{
  "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
  "articleType": "EVENT",
  "articleName": "Western philosophy",
  "articleContentList": [
    "ab057ca6-7503-4421-bcb1-e63fd44f86db",
    "6367b5c5-84df-4651-a7a4-28f603f64832",
    "2b6be73e-6494-4826-88ff-9c5bc4838f91",
    "e1c3aa14-24c4-46de-8a4e-1cd006f930c2",
    "d2d5dbc5-6da4-4ece-837b-6317ff2d9bae",
    "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
    "9d346409-dbed-4de7-ac35-cf74b033c8e7"
  ],
  "createdAt": "2025-04-26T21:52:15.545Z",
  "updatedAt": "2025-04-26T21:52:15.545Z",
  "contents": [
    {
      "contentId": "e352d963-ba2b-4b5f-a32b-3533baae982c",
      "contentName": "Cosmology and the metaphysics of matter",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "173ad8a6-566f-4f95-a797-63c5cc25c135",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:06.125Z",
      "updatedAt": "2025-04-26T21:51:06.125Z",
      "images": []
    },
    {
      "contentId": "5f0cffd9-8cd2-4ec9-aea9-62aad0c75a78",
      "contentName": "Pluralistic cosmologies",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "e352d963-ba2b-4b5f-a32b-3533baae982c",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:03.882Z",
      "updatedAt": "2025-04-26T21:51:03.882Z",
      "images": []
    },
    {
      "contentId": "9d346409-dbed-4de7-ac35-cf74b033c8e7",
      "contentName": "Contemporary philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": null,
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:15.545Z",
      "updatedAt": "2025-04-26T21:52:15.545Z",
      "images": []
    },
    {
      "contentId": "57f2e999-f414-44bd-97ca-f17b94316158",
      "contentName": "Continental philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "9d346409-dbed-4de7-ac35-cf74b033c8e7",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:13.441Z",
      "updatedAt": "2025-04-26T21:52:13.441Z",
      "images": []
    },
    {
      "contentId": "6bc1aa53-a0bc-47ff-913e-870b2c18352e",
      "contentName": "Recent trends",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "57f2e999-f414-44bd-97ca-f17b94316158",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:11.683Z",
      "updatedAt": "2025-04-26T21:52:11.683Z",
      "images": []
    },
    {
      "contentId": "b9311187-3628-4e80-a2cd-0ff65f82a0b3",
      "contentName": "The existentialism of Jaspers and Sartre",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "57f2e999-f414-44bd-97ca-f17b94316158",
      "content": "Existentialism, true to its roots in Kierkegaard and Nietzsche, was oriented toward two major themes: the analysis ofhumanexistence, or Being, and the centrality of human choice. Thus, its chief theoretical energies were devoted toontologyand decision.\nExistentialism as a philosophy of human existence was best expressed in the work of the German philosopherKarl Jaspers(1883–1969), who came to philosophy from medicine andpsychology. For Jaspers as for Dewey, the aim of philosophy is practical. But whereas for Dewey philosophy is to guide human action, for Jaspers its purpose is the revelation of Being, “the illumination of existence,” the answering of the questions of what human beings are and what they can become. This illumination is achieved, and Being is revealed most profoundly, through the experience of “extreme” situations that define the human condition—conflict, guilt, suffering, and death. It is through a confrontation with these extremes that the individual realizes hisexistentialhumanity.\nThe chief representative of existentialism as a philosophy of human decision was the French philosopher and man of lettersJean-Paul Sartre(1905–80). Sartre too was concerned withBeingand with the dread experienced before the threat of Nothingness. But he found the essence of this Being in liberty—in freedom of choice and the duty of self-determination. He therefore devoted much effort to describing the human tendency toward “bad faith,” reflected in perverse attempts to deny one’s own responsibility and to flee from thetruthof one’s inescapable freedom. Sartre did not overlook thelegitimateobstacles to freedom presented by the facts of place, past,environment, society, and death. However, he demanded that one surmount these limitations through acts of conscious decision, for only in acts of freedom does human existence achieve authenticity. InThe Second Sex(1949),Simone de Beauvoir(1908–86), Sartre’s fellow philosopher and lifelong companion, attempted to mobilize the existentialist concept of freedom for the ends of modern feminism.\nAfter World War II, Sartre came to believe that his philosophy of freedom had wrongly ignored problems ofsocial justice, and in his later work, especially theCritique of Dialectical Reason(1960), he sought toreconcileexistentialism withMarxism.",
      "imagesId": [
        "2dc7d8f0-b77f-4979-b536-a3e7cfff83c2",
        "b7037ea9-b28a-4d44-9abd-357ff5dd9fd7"
      ],
      "createdAt": "2025-04-26T21:52:11.438Z",
      "updatedAt": "2025-04-26T21:52:11.438Z",
      "images": [
        {
          "imageId": "b7037ea9-b28a-4d44-9abd-357ff5dd9fd7",
          "contentId": "b9311187-3628-4e80-a2cd-0ff65f82a0b3",
          "src": "https://cdn.britannica.com/76/9476-050-6661C2E1/photograph-Jean-Paul-Sartre-Gisele-Freund-1968.jpg?w=300",
          "alt": "Jean-Paul Sartre",
          "caption": "Jean-Paul SartreJean-Paul Sartre, photograph by Gisèle Freund, 1968.(more)",
          "width": 1232,
          "height": 1600,
          "createdAt": "2025-04-26T21:52:11.438Z",
          "updatedAt": "2025-04-26T21:52:11.438Z"
        },
        {
          "imageId": "2dc7d8f0-b77f-4979-b536-a3e7cfff83c2",
          "contentId": "b9311187-3628-4e80-a2cd-0ff65f82a0b3",
          "src": "https://cdn.britannica.com/87/10687-050-55699AA6/Karl-Jaspers-1968.jpg?w=300",
          "alt": "Karl Jaspers",
          "caption": "Karl JaspersKarl Jaspers, 1968.(more)",
          "width": 1299,
          "height": 1600,
          "createdAt": "2025-04-26T21:52:11.438Z",
          "updatedAt": "2025-04-26T21:52:11.438Z"
        }
      ]
    },
    {
      "contentId": "6c9d4131-e8d4-4741-849b-de2744f6a85f",
      "contentName": "The phenomenology of Husserl and Heidegger",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "57f2e999-f414-44bd-97ca-f17b94316158",
      "content": "Considered the father of phenomenology,Edmund Husserl(1859–1938), a German mathematician-turned-philosopher, was an extremely complicated and technical thinker whose views changed considerably over the years. His chief contributions were the phenomenological method, which he developed early in his career, and the concept of the “life-world,” which appeared only in his later writings. As a technique of phenomenological analysis, the phenomenological method was to make possible “a descriptive account of the essential structures of the directly given.” It was to isolate and lay bare theintrinsicstructure of conscious experience by focusing the philosopher’s attention on the pure data ofconsciousness, uncontaminated bymetaphysicaltheories or scientific orempiricalassumptions of any kind. Husserl’s concept of the life-world is similarly concerned with immediate experience. It is the individual’s personal world as he directly experiences it, with the ego at the centre and with all of its vital and emotional colourings.\nWith theappearanceof theJahrbuch für Philosophie und phänomenologische Forschung(1913–30; “Annual for Philosophical and Phenomenological Research”) under Husserl’s chief editorship, his philosophy flowered into an international movement. Its most-notable adherent wasMartin Heidegger(1889–1976), whose masterpiece,Being and Time, appeared in theJahrbuchin 1927. The influence of the phenomenological method is clear in Heidegger’s work; throughout his startlingly original investigations of human existence—with their unique dimensions of “being-in-the-world,” dread, care, and “being-toward-death”—Heidegger adheres to the phenomenological principle that philosophy is not empirical but is the strictly self-evident insight into the structure of experience. Later, the French philosophical psychologistMaurice Merleau-Ponty(1908–61), building on the concept of the life-world, used the notions of the lived body and its “facticity” to create ahierarchyof human-lived experience.",
      "imagesId": [
        "1b919bdb-2fd2-402a-a4a3-d1aa6d70fe5a",
        "0e2b8a14-6a0d-4d65-bee6-2617368a5422"
      ],
      "createdAt": "2025-04-26T21:52:11.162Z",
      "updatedAt": "2025-04-26T21:52:11.162Z",
      "images": [
        {
          "imageId": "1b919bdb-2fd2-402a-a4a3-d1aa6d70fe5a",
          "contentId": "6c9d4131-e8d4-4741-849b-de2744f6a85f",
          "src": "https://cdn.britannica.com/62/10862-050-6C7D61F4/Edmund-Husserl-1930.jpg?w=300",
          "alt": "Edmund Husserl",
          "caption": "Edmund HusserlEdmund Husserl, c. 1930.(more)",
          "width": 1357,
          "height": 1600,
          "createdAt": "2025-04-26T21:52:11.162Z",
          "updatedAt": "2025-04-26T21:52:11.162Z"
        },
        {
          "imageId": "0e2b8a14-6a0d-4d65-bee6-2617368a5422",
          "contentId": "6c9d4131-e8d4-4741-849b-de2744f6a85f",
          "src": "https://cdn.britannica.com/38/11138-004-6699034E/Martin-Heidegger.jpg?w=300",
          "alt": "Martin Heidegger",
          "caption": "Martin Heidegger(more)",
          "width": 217,
          "height": 300,
          "createdAt": "2025-04-26T21:52:11.162Z",
          "updatedAt": "2025-04-26T21:52:11.162Z"
        }
      ]
    },
    {
      "contentId": "5bb3272c-d4c9-4f2e-b4e4-4579beada04d",
      "contentName": "Analytic philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "9d346409-dbed-4de7-ac35-cf74b033c8e7",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:10.572Z",
      "updatedAt": "2025-04-26T21:52:10.572Z",
      "images": []
    },
    {
      "contentId": "1f9818e9-05a7-4188-9026-eedafe237ff3",
      "contentName": "The informalist tradition",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "5bb3272c-d4c9-4f2e-b4e4-4579beada04d",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:08.480Z",
      "updatedAt": "2025-04-26T21:52:08.480Z",
      "images": []
    },
    {
      "contentId": "90d868e0-00e7-4add-bbba-34cb3a735fc3",
      "contentName": "Monistic cosmologies",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "e352d963-ba2b-4b5f-a32b-3533baae982c",
      "content": "There is aconsensus, dating back at least to the 4th centurybceand continuing to the present, that the first Greek philosopher wasThalesof Miletus (flourished 6th centurybce). In Thales’ time the wordphilosopher(“lover of wisdom”) had not yet been coined. Thales was counted, however, among the legendarySeven Wise Men(Sophoi), whose name derives from a term that then designated inventiveness and practical wisdom rather than speculative insight. Thales demonstrated these qualities by trying to give the mathematical knowledge that hederivedfrom the Babylonians a more exact foundation and by using it for the solution of practical problems—such as the determination of the distance of a ship as seen from the shore or of the height of the Egyptian pyramids. Although he was also credited with predicting aneclipse of the Sun, it is likely that he merely gave a naturalexplanationof one on the basis of Babylonian astronomical knowledge.\nThales is considered the first Greek philosopher because he was the first to give a purely natural explanation of the origin of the world, free from mythological ingredients. He held that everything had come out ofwater—an explanation based on the discovery of fossil sea animals far inland. His tendency (and that of his immediate successors) to give nonmythological explanations was undoubtedly prompted by the fact that all of them lived on the coast ofAsia Minor, surrounded by a number of nations whose civilizations were much further advanced than that of the Greeks and whose own mythological explanations varied greatly. It appeared necessary, therefore, to make a fresh start on the basis of what a person could observe and infer by looking at the world as it presented itself. This procedure naturally resulted in a tendency to make sweeping generalizations on the basis of rather restricted, though carefully checked, observations.\nThales’discipleand successor,Anaximanderof Miletus (610–c. 546bce), tried to give a more elaborate account of the origin and development of the ordered world (the cosmos). According to him, it developed out of theapeiron(“unlimited”), something bothinfiniteand indefinite (without distinguishable qualities). Within thisapeironsomething arose to produce the opposites of hot and cold. These at once began to struggle with each other and produced the cosmos. The cold (and wet) partly dried up (becoming solid earth), partly remained (as water), and—by means of the hot—partly evaporated (becoming air and mist), its evaporating part (by expansion) splitting up the hot into fiery rings, which surround the whole cosmos. Because these rings areenvelopedby mist, however, there remain only certain breathing holes that are visible to human beings, appearing to them as the Sun, Moon, and stars. Anaximander was the first to realize that upward and downward are not absolute but that downward means toward the middle of the Earth and upward away from it, so that the Earth had no need to be supported (as Thales had believed) by anything. Starting from Thales’ observations, Anaximander tried to reconstruct the development of life in more detail.Life, being closely bound up with moisture, originated in the sea. All land animals, he held, are descendants of sea animals; because the first humans as newborn infants could not have survived without parents, Anaximander believed that they were born within an animal of another kind—specifically, a sea animal in which they were nurtured until they could fend for themselves. Gradually, however, the moisture will be partly evaporated, until in the end all things will return into the undifferentiatedapeiron, “in order to pay the penalty for their injustice”—that of having struggled against one another.\nAnaximander’s successor,Anaximenesof Miletus (flourished c. 545bce), taught thatairwas the origin of all things. His position was for a long time thought to have been a step backward because, like Thales, he placed a special kind of matter at the beginning of the development of the world. But thiscriticismmissed the point. Neither Thales nor Anaximander appear to have specified the way in which the other things arose out of water orapeiron. Anaximenes, however, declared that the other types of matter arose out of air by condensation and rarefaction. In this way, what to Thales had been merely a beginning became a fundamental principle that remained essentially the same through all of its transmutations. Thus, the termarche, which originally simply meant “beginning,” acquired the new meaning of “principle,” a term that henceforth played an enormous role inphilosophydown to the present. This concept of a principle that remains the same through many transmutations is, furthermore, the presupposition of theideathat nothing can come out of nothing and that all of the comings to be and passings away that human beings observe are nothing but transmutations of something that essentially remains the same eternally. In this way it also lies at the bottom of all of the conservation laws—the laws of theconservation of matter, force, and energy—that have been basic in the development ofphysics. Although Anaximenes of course did not realize all of theimplicationsof his idea, its importance can hardly be exaggerated.\nThe first three Greek philosophers have often been called “hylozoists” because they seemed to believe in a kind of living matter (seehylozoism). But this is hardly an adequate characterization. It is, rather, characteristic of them that they did not clearly distinguish between kinds of matter, forces, and qualities, nor between physical and emotional qualities. The same entity is sometimes called “fire” and sometimes “the hot.” Heat appears sometimes as a force and sometimes as aquality, and again there is no clear distinction between warm and cold as physical qualities and the warmth of love and the cold of hate. To realize theseambiguitiesis important to an understanding of certain later developments in Greek philosophy.\nXenophanesof Colophon (c. 560–c. 478bce), a rhapsodist and philosophical thinker who emigrated from Asia Minor to Elea in southern Italy, was the first toarticulatemore clearly what was implied in Anaximenes’ philosophy. He criticized the popular notions of the gods, saying that people made the gods in their own image. But, more importantly, he argued that there could be only one God, the ruler of the universe, who must be eternal. For, being the strongest of all beings, he could not have come out of something less strong, nor could he be overcome or superseded by something else, because nothing could arise that is stronger than the strongest. The argument clearly rested on theaxiomsthat nothing can come out of nothing and that nothing that exists can vanish.\nThese axioms were made more explicit and carried to their logical (and extreme) conclusions byParmenidesof Elea (born c. 515bce), the founder of the so-called school ofEleaticism, of whom Xenophanes has been regarded as the teacher and forerunner. In a philosophical poem, Parmenides insisted that “what is” cannot have come into being and cannot pass away because it would have to have come out of nothing or to become nothing, whereas nothing by its very nature does not exist. There can be no motion either, for it would have to be a motion into something that is—which is not possible since it would be blocked—or a motion into something that is not—which is equally impossible since what is not does not exist. Hence, everything is solid, immobile being. The familiar world, in which things move around, come into being, and pass away, is a world of merebelief(doxa). In a second part of the poem, however, Parmenides tried to give ananalyticalaccount of this world of belief, showing that it rested on constant distinctions between what is believed to be positive—i.e., to have real being, such as light and warmth—and what is believed to be negative—i.e., the absence of positive being, such as darkness and cold.\nIt is significant thatHeracleitusof Ephesus (c. 540–c. 480bce), whose philosophy was later considered to be the very opposite of Parmenides’ philosophy of immobile being, came, in some fragments of his work, near to what Parmenides tried to show: the positive and the negative, he said, are merely different views of the same thing; death and life, day and night, and light and darkness are really one.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:03.281Z",
      "updatedAt": "2025-04-26T21:51:03.281Z",
      "images": []
    },
    {
      "contentId": "6367b5c5-84df-4651-a7a4-28f603f64832",
      "contentName": "The nature of Western philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": null,
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:02.977Z",
      "updatedAt": "2025-04-26T21:51:02.977Z",
      "images": []
    },
    {
      "contentId": "edca17bb-af31-461f-af78-f890606fd04a",
      "contentName": "General considerations",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "6367b5c5-84df-4651-a7a4-28f603f64832",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:01.215Z",
      "updatedAt": "2025-04-26T21:51:01.215Z",
      "images": []
    },
    {
      "contentId": "e358abf8-26fa-4ae8-a7e1-15ca2f43c553",
      "contentName": "Shifts in the focus and concern of Western philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "edca17bb-af31-461f-af78-f890606fd04a",
      "content": "Any adequate treatment of individual figures in the history of philosophy tries to utilize this threefold division of logical, sociological, and individual factors; but in a synoptic view of the history of philosophy in the West, one is particularly aware of the various shifts of focus and concern that philosophy has sustained and, indeed, of the often profound differences in the way that it defines itself or visualizes its task from age to age or from generation to generation.\nPhilosophy among the Greeks slowly emerged out of religious awe into wonder about the principles and elements of the natural world. But as the Greek populations more and more left the land to become concentrated in their cities, interest shifted from nature to social living; questions of law and convention and civic values became paramount. Cosmological speculation partly gave way tomoraland political theorizing, and the preliminary and somewhat fragmentary questionings of Socrates and the Sophists turned into the great positive constructions of Plato and Aristotle. With the political and social fragmentation of the succeeding centuries, however, philosophizing once again shifted from the norm of civic involvement to problems of salvation and survival in a chaotic world.\nThe dawn ofChristianitybrought to philosophy new tasks.St. Augustine(354–430)—the philosophical bishop of Hippo—and the Church Fathers used such resources of the Greek tradition as remained (chieflyPlatonism) to deal with problems of creation, of faith and reason, and oftruth. New translations in the12th centurymade much of Aristotle’s philosophy available and prepared the way for the great theological constructions of the 13th century, chiefly those of the Scholastic philosophersSt. Bonaventure(c. 1217–74),St. Albertus Magnus(c. 1200–80), St. Thomas Aquinas,Roger Bacon(c. 1220–92), andJohn Duns Scotus(c. 1266–1308). The end of the Middle Ages saw a new flowering of the opposite tendencies in thenominalismofWilliam of Ockham(c. 1285–c. 1347) and the mysticism ofMeister Eckhart(c. 1260–c. 1327).\nThe Middle Ages gave way to the Renaissance. Universalism was replaced bynationalism. Philosophy became secularized. The great new theme was that of the mystery and immensity of the natural world. The best philosophical minds of the 17th century turned to the task of exploring the foundations ofphysical science, and the symbol of their success—the great system ofphysicsconstructed bySir Isaac Newton(1642–1727)—turned the philosophers of the Enlightenment toepistemologyand to the examination of the human mind that had produced so brilliant a scientific creation. The 19th century, a time of great philosophicaldiversity, discovered the irrational, and in so doing prepared the way for the 20th-century oppositions betweenlogical atomismandphenomenologyand betweenlogical positivismandexistentialism.\nAlthough the foregoing capsule presentation of the history of philosophy in the West follows a strict chronology, it does not dojusticeto the constant occurrence and recurrence of dominant strands in the history of thought. It would also be possible to write the philosophical history of the Middle Ages simply by noting the complicated occurrence ofPlatonicand Aristotelian doctrines, of the Renaissance according to the reappearance of ancientmaterialism,Stoicism, andskepticism, and of the 18th century in terms of the competing claims of rationalist and empiricist principles. Thus, chronology and the interweaving of philosophical systems cooperate in a history of philosophy.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:50:59.116Z",
      "updatedAt": "2025-04-26T21:50:59.116Z",
      "images": []
    },
    {
      "contentId": "b87721b1-9478-427e-b557-5857b4730d62",
      "contentName": "Factors in writing the history",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "edca17bb-af31-461f-af78-f890606fd04a",
      "content": "The type of ordering suggested above also has some relationship to the more general problems of method in the writing of the history of philosophy. Here there are at least three factors that must be taken into account: (1) that any philosopher’s doctrines depend (at least in part) upon those of his predecessors, (2) that a philosopher’s thought occurs at a certain point in history and thus expresses the effects of certain social and cultural circumstances, and (3) that a philosopher’s thought stems (at least in part) from his own personality and situation in life. This is only to say that the history of philosophy, to be at allcomprehensiveand adequate, must deal with the mutual interplay of ideas, of culturalcontexts, and of agents.\nThe first factor may be called logical because a given philosophy is, in part, the intellectual response to the doctrines of its forerunners, taking as central the problems given by the current climate of controversy. Thus, many of the details ofAristotle’sethical, political, andmetaphysicalsystems arise in arguments directed against statements and principles of Plato; much ofAn Essay Concerning Human Understanding(1690) by the English philosopherJohn Locke(1632–1704), an initiator of theEnlightenment, is directed against contemporary Cartesian presuppositions; and theNew Essays Concerning Human Understanding(1704) byGottfried Wilhelm Leibniz(1646–1716), a broadly learned German rationalist, is, in turn, specifically directed against Locke.\nThe second factor may be calledsociologicalbecause it considers philosophy, at least in part, as a direct form of social expression, arising at a certain moment in history, dated and marked by the peculiar problems and crises of the society in which it flourishes. From this perspective, the philosophy ofPlatomay be viewed as the response of an aristocratic elitism to the immediate threat ofdemocracyand the leveling of values in 5th-century Athens—its social theory and even itsmetaphysicsserving the movement toward an aristocratic restoration in the Greek world. Thus, the philosophy ofSt. Thomas Aquinasmay be viewed as an effort toward doctrinal clarification in support of the institution of the medievalRoman Catholic Church, as the saint spent his life obediently fulfilling the philosophical tasks set for him by his superiors in the church and the Dominican order. Thus, the philosophy ofKant, with all of its technical vocabulary and rigid systematization, may be viewed as an expression of the new professionalism in philosophy, a clear product of the rebirth of the German universities during the 18th-century Enlightenment.\nThe third factor may be calledbiographical, or individual, because, with Hegel, it recognizes that philosophies are generally produced by people of unusual or independent personality, whose systems usually bear the mark of their creators. And what is meant here by the individuality of the philosopher lies less in the facts of his biography (such as his wealth or poverty) than in the essential form and style of his philosophizing. The cool intensity of Spinoza’s geometric search for wisdom, the unswerving (if opaque) discursiveness of Hegel’s quest for completeness or totality, the relentless and minuteanalyticsearch for distinctions and shades of meaning that marks Moore’s master passion (“to be accurate—to get everything exactly right”)—these qualities mark the philosophical writings of Spinoza, Hegel, and Moore with an unmistakably individual and original character.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:50:58.522Z",
      "updatedAt": "2025-04-26T21:50:58.522Z",
      "images": []
    },
    {
      "contentId": "71686816-4119-41a2-8d86-9dc16e635283",
      "contentName": "Ways of ordering the history",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "edca17bb-af31-461f-af78-f890606fd04a",
      "content": "Thewritingof the history ofphilosophyis controlled by a variety of cultural habits and conventions.\nThe ensuing article on the history of Western philosophy is divided into five sections—ancient,medieval, Renaissance, modern, and contemporary. A threefold distinction between ancient, medieval, andmodern philosophywas prevalent until recent times and is only as old as the end of the 17th century. This distinction slowly spread to historical writing in all fields and was given definitive influence in philosophical writing through the series of lectures on the history of philosophy thatHegeldelivered first at Jena, then at Heidelberg, and finally at Berlin between 1805 and 1830. In the century after Hegel, it was taken for granted as standard practice, though a host of cultural assumptions is implied by its use.\nTreatment of the total field of the history of philosophy has been traditionally subject to two types of ordering, according to whether it was conceived primarily as (1) a history of ideas or (2) a history of theintellectualproducts of human beings. In the first ordering, certain ideas, or concepts, are viewed as archetypal (such as matter or mind or doubt), and the condensations occurring within the flow of thought tend to consist of basic types, or schools. This ordering has characterized works such asThe History of Materialism(1866) byFriedrich Lange(1828–75),The Idealist Tradition: From Berkeley to Blanshard(1957) byA.C. Ewing(1899–1973), andThe History of Scepticism from Erasmus to Descartes(1960) byRichard H. Popkin (1923–2005). In the second type of ordering, the historian, impressed by the producers of ideas as much as by the ideas themselves—that is, with philosophers as agents—reviews the succession of great philosophical personalities in their rational achievements. This ordering has produced the more customary histories, such asA History of Western Philosophy(1945) byBertrand RussellandThe Great Philosophers(1957) byKarl Jaspers(1883–1969).\nThese two different types of ordering depend for their validity upon an appeal to two different principles about the nature of ideas, but their incidental use may also be influenced by social or cultural factors. Thus, the biographers and compilers of late antiquity (among themPlutarch[46–c. 119],Sextus Empiricus[flourished 3rd centuryce],Philostratus[170–c. 245], andClement of Alexandria[150–c. 211]), impressed by the religiouspluralismof the age in which they lived, thought of philosophers, too, as falling into different sects and wrote histories of the Sophists, the Skeptics, the Epicureans, and other such schools; whereas, almost 2,000 years later, Hegel—living in a period ofRomantichistoriography dominated by the concept of the great man in history—deliberately described the history of philosophy as “a succession of noble minds, a gallery of heroes of thought.”\nMoving between these two ordering principles, the article below will beeclectic(as has come to be the custom), devoting chief attention to outstanding major figures while joining more-minor figures, wherever possible, into the schools or tendencies that they exemplify.",
      "imagesId": [
        "cc4ae088-9a4f-444e-b8cc-d5a0895ab8bc"
      ],
      "createdAt": "2025-04-26T21:50:58.031Z",
      "updatedAt": "2025-04-26T21:50:58.031Z",
      "images": [
        {
          "imageId": "cc4ae088-9a4f-444e-b8cc-d5a0895ab8bc",
          "contentId": "71686816-4119-41a2-8d86-9dc16e635283",
          "src": "https://cdn.britannica.com/41/66541-050-E52AF2FC/Plutarch-c-100-ce.jpg?w=300",
          "alt": "Plutarch",
          "caption": "PlutarchPlutarch, c. 100ce.(more)",
          "width": 1305,
          "height": 1600,
          "createdAt": "2025-04-26T21:50:58.032Z",
          "updatedAt": "2025-04-26T21:50:58.032Z"
        }
      ]
    },
    {
      "contentId": "b085ee8a-9a19-467b-a060-0db5fadb5b6d",
      "contentName": "The Western tradition",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "6367b5c5-84df-4651-a7a4-28f603f64832",
      "content": "It would be difficult if not impossible to find two philosophers who would define philosophy in exactly the same way. Throughout its long and varied history in the West, philosophy has meant many different things. Some of these have been a search for wisdom (the meaning closest to the Latinphilosophia, itself derived from the Greekphilosoph, “lover of wisdom”); an attempt to understand the universe as a whole; an examination of humankind’smoralresponsibilities and social obligations; an effort to fathom the divine intentions and the place of human beings with reference to them; an effort to ground the enterprise of natural science; a rigorous examination of the origin, extent, and validity of human ideas; an exploration of the place of will orconsciousnessin the universe; an examination of the values oftruth, goodness, and beauty; and an effort to codify the rules of human thought in order to promote rationality and the extension of clear thinking. Even these do not exhaust the meanings that have been attached to the philosophical enterprise, but they give someideaof its extreme complexity and many-sidedness.\nIt is difficult to determine whether any common element can be found within thisdiversityand whether any core meaning can serve as a universal and all-inclusive definition. But a first attempt in this direction might be to define philosophy either as “a reflection upon the varieties of human experience” or as “the rational, methodical, and systematic consideration of those topics that are of greatest concern to humankind.” Vague and indefinite as such definitions are, they do suggest two important facts about philosophizing: (1) that it is a reflective, or meditative, activity and (2) that it has no explicitly designated subject matter of its own but is a method or type of mental operation (likescienceor history) that can take any area or subject matter or type of experience as its object. Thus, although there are a few single-term divisions of philosophy of long standing—such aslogic,ethics,epistemology, ormetaphysics—its divisions are probably best expressed by phrases that contain the prepositionof—such asphilosophy of mind,philosophy of science,philosophy of law, andphilosophy of art(aesthetics).\nPart of what makes it difficult to find aconsensusamong philosophers about the definition of theirdisciplineis precisely that they have frequently come to it from different fields, with different interests and concerns, and that they therefore have different areas of experience upon which they find it especially necessary or meaningful to reflect.St. Thomas Aquinas(c. 1224–75), a Dominican friar,George Berkeley(1685–1753), a bishop of the Irish Church, andSøren Kierkegaard(1813–55), a Danish divinity student, all saw philosophy as a means to assert the truths of religion and to dispel the materialistic or rationalistic errors that, in their opinion, had led to its decline.Pythagoras(c. 580–c. 500bce) in southern Italy,René Descartes(1596–1650) in France, andBertrand Russell(1872–1970) in England were primarily mathematicians whose views of the universe and of human knowledge were vastly influenced by theconceptof number and by the method of deductive thinking. Some philosophers, such asPlato(c. 428–c. 348bce),Thomas Hobbes(1588–1679) andJohn Stuart Mill(1806–73), were obsessed by problems of political arrangement and social living, so that whatever they have done in philosophy has been stimulated by a desire to understand and, ultimately, to change the social and political behaviour of human beings. And still others—such as the Milesians (the first philosophers of Greece, from the ancient Anatolian city ofMiletus),Francis Bacon(1561–1626), an Elizabethan philosopher, andAlfred North Whitehead(1861–1947), an English metaphysician—began with an interest in the physicalcompositionof the natural world, so that their philosophies resemble more closely the generalizations ofphysical sciencethan those of religion orsociology.\nThe history of Western philosophy reveals in detail the concentrated activity of a multitude of serious and able thinkers reflecting upon, reasoning about, and considering deeply the nature of their experience. But throughout this diversity certain characteristic oppositions continually recur, such as those between monism,dualism, andpluralisminmetaphysics(seepluralism and monism); betweenmaterialismandidealismin cosmological theory; betweennominalismandrealismin the theory of signification; betweenrationalismandempiricismin epistemology; betweenutilitarianismanddeontological ethicsin moral theory; and between partisans of logic and partisans of emotion in the search for a responsible guide to the wisdom of life.\nMany of these fundamental oppositions among philosophers will be treated in the article that follows. But if any single opposition is taken as central throughout the history of Western philosophy at every level and in every field, it is probably that between the critical and the speculative impulses. These two divergent motivations tend to express themselves in two divergent methods:analysisandsynthesis, respectively. Plato’sRepublicis an example of the second; thePrincipia Ethica(1903) ofG.E. Moore(1873–1958), a founder ofanalytic philosophy, is an example of the first. Beginning with a simple question aboutjustice, theRepublicin its discursiveness slowly but progressively brings more and more areas into the discussion: firstethics, then politics, then educational theory, then epistemology, and finally metaphysics. Starting with one specific question, Plato finally managed to make his discussion as broad as the world.Principia Ethicadoes just the opposite. Beginning with a general question—What is good?—it progressively breaks up this question into a whole series of subordinate questions, analyzing meanings ever more minutely, growing narrower and narrower but always with the utmost modesty and sincerity, striving for increasing simplicity and exactitude.\nTheanalytic, or critical, impulse treats any subject matter or topic by concentrating upon the part, by taking it apart in the service of clarity and precision. It was essentially the method ofAristotle(384–322bce) and ofPeter Abelard(1079–1142), a French Scholastic; ofDavid Hume(1711–76), a Scottish skeptic, and ofRudolf Carnap(1891–1970), a German American logical positivist; and of Russell and Moore. Thesynthetic, or speculative, impulse operates by seeking to comprehend the whole, by putting it all together in the service of unity and completeness. It is essentially the method ofParmenides, aSophist, and of Plato; of Aquinas and ofBenedict de Spinoza(1632–77), a Dutch Jewish rationalist; and ofGeorg Wilhelm Friedrich Hegel(1770–1831), a German idealist, and of Whitehead. Throughout philosophy’s history, each of the two traditions has made its insistent claim.\nThere is one philosophical tradition—that oflogical positivism—that sees philosophy as originating in the obscure mists of religion and coming finally to rest in the pure sunshine of scientific clarity. This represents a necessary progress because logical positivism considers it a scandal when philosophers speak in statements that are not in principle “verifiable” (seeverifiability principle); it holds that bold and adventuresome philosophicalspeculationis at best mere self-indulgence, a passing state occurring when philosophical problems are raised prematurely—that is, at a time when philosophy does not possess the means to solve them.\nAlthough logical positivism represents a partisan view, it does express indirectly a basic truth—that the philosophical enterprise has always hovered uncertainly between the lure of religious devotion and that of scientific exactitude. In the teachings of the earliest philosophers of Greece, it is impossible to separate ideas of divinity and the human soul from ideas about the mystery of being and the genesis of material change, and in the Middle Ages philosophy was acknowledged to be the “handmaiden of theology.” But the increased secularization of modernculturehas largely reversed this trend, and theEnlightenment’s emphasis upon the separation of nature from its divine creator has increasingly placed philosophical resources at the disposal of those interested in creating a philosophy of science.\nYet philosophy’s continuing search for philosophical truth leads it to hope, but at the same time to profoundly doubt, that its problems are objectively solvable. With respect to a total description of Being or a definitive account of the nature of values, only individual solutions now seem possible; and the optimistic hope for objective answers that secure universal agreement must be given up.\nIn this respect, philosophy seems less like science than like art and philosophers more like artists than like scientists, for their philosophical solutions bear the stamp of their own personalities, and their choice of arguments reveals as much about themselves as their chosen problem. As a work of art is a portion of the world seen through a temperament, so a philosophical system is a vision of the world subjectively assembled. Plato and Descartes,Immanuel Kant(1724–1804), a German idealist, andJohn Dewey(1859–1952), an American pragmatist, have given to their systems many of thequainttrappings of their own personalities.\nBut if philosophy is not true in the same sense as science, it is not false in the same sense either; and this gives to the history of philosophy a living significance that thehistory of sciencedoes not enjoy. In science, the present confronts the past as truth confronts error; thus, for science, the past, even when important at all, is important only out of historical interest. In philosophy it is different. Philosophical systems are never definitively proved false; they are simply discarded or put aside for future use. And this means that the history of philosophy consists not simply of dead museum pieces but of ever-living classics—comprising a permanentrepositoryof ideas, doctrines, and arguments and a continuing source of philosophical inspiration and suggestiveness to those who philosophize in any succeeding age. It is for this reason that any attempt to separate philosophizing from the history of philosophy is both a provincial act and an unnecessary impoverishment of its rich natural resources.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:50:57.411Z",
      "updatedAt": "2025-04-26T21:50:57.411Z",
      "images": []
    },
    {
      "contentId": "a080dfb8-20ae-4ac4-9ba0-782685b88f01",
      "contentName": "Speech-act theory",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1f9818e9-05a7-4188-9026-eedafe237ff3",
      "content": "Austin was also the creator of one of the most-original philosophical theories of the 20th century: speech-act theory. A speech act is an utterance that is grammatically similar to a statement but is neither true nor false, though it is perfectly meaningful. For example, the utterance “I do,” performed in the normal circumstances of marrying, is neither true nor false. It is not a statement but an action—a speech act—the primary effect of which is to complete the marriage ceremony. Similarconsiderationsapply to utterances such as “I christen thee theQueen Elizabeth,” performed in the normal circumstances of christening a ship. Austin called such utterances “performatives” in order to indicate that, in making them, one is not only saying something but also doing something.\nThe theory of speech acts was, in effect, a profoundcriticismof the positivist thesis that every meaningful sentence is either true or false. The positivist view, according to Austin, embodies a “descriptive fallacy,” in the sense that it treats the descriptive function of language as primary and more or less ignores other functions. Austin’s account of speech acts was thus a corrective to that tendency.\nAfter Austin’s death in 1960, speech-act theory was deepened and refined by his American studentJohn R. Searle. InThe Construction of Social Reality(1995), Searle argued that many social and political institutions are created through speech acts. Money, for example, is created through a declaration by a government to the effect that pieces of paper or metal of a certain manufacture and design are to count as money. Many institutions—such as banks, universities, and police departments—are socialentitiescreated through similar speech acts. Searle’s development of speech-act theory was thus an unexpected extension of thephilosophy of languageinto social and political theory.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:06.499Z",
      "updatedAt": "2025-04-26T21:52:06.499Z",
      "images": []
    },
    {
      "contentId": "ff919397-1cc0-48b9-b554-7ef19bcf71da",
      "contentName": "Ordinary-language philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1f9818e9-05a7-4188-9026-eedafe237ff3",
      "content": "The two major proponents of ordinary-language philosophy were the English philosophersGilbert Ryle(1900–76) andJ.L. Austin(1911–60). Both held, though for different reasons, that philosophical problems frequently arise through a misuse or misunderstanding of ordinary speech. InThe Concept of Mind(1949), Ryle argued that the traditionalconceptionof the human mind—that it is an invisible ghostlike entity occupying a physical body—is based on what he called a “category mistake.” The mistake is to interpret the termmindas though it wereanalogousto the termbodyand thus to assume that both terms denote entities, one visible (body) and the other invisible (mind). Hisdiagnosisof this error involved an elaborate description of how mental epithets actually work in ordinary speech. To speak of intelligence, for example, is to describe how human beings respond to certain kinds of problematic situations. Despite the behaviourist flavour of his analyses, Ryle insisted that he was not a behaviourist and that he was instead “charting the logical geography” of the mental concepts used in everyday life.\nAustin’s emphasis was somewhat different. In a celebrated paper, “A Plea for Excuses” (1956), he explained that the appeal to ordinary language in philosophy should be regarded as the first word but not the last word. That is, one should be sensitive to thenuancesof everyday speech in approaching conceptual problems, but in certain circumstances everyday speech can, and should, be augmented by technical concepts. According to the “first-word” principle, because certain distinctions have been drawn in ordinary language for eons—e.g., males from females, friends from enemies, and so forth—one can conclude not only that the drawing of such distinctions is essential to everyday life but also that such distinctions are more than merely verbal. They pick out, or discriminate, actual features of the world. Starting from this principle, Austin dealt with major philosophical difficulties, such as theproblem of other minds, the nature oftruth, and the nature of responsibility.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:05.887Z",
      "updatedAt": "2025-04-26T21:52:05.887Z",
      "images": []
    },
    {
      "contentId": "5c264d1e-6f9a-4a75-a916-e9487c87d432",
      "contentName": "Common-sense philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1f9818e9-05a7-4188-9026-eedafe237ff3",
      "content": "Originating as a reaction against the forms ofidealismandskepticismthat were prevalent in England at about the turn of the 20th century, the first major work of common-sense philosophy was Moore’s paper “A Defense of Common Sense” (1925). Againstskepticism, Moore argued that he and other human beings have known many propositions about the world to be true with certainty. Among these propositions are: “The Earth has existed for many years” and “Many human beings have existed in the past and some still exist.” Because skepticism maintains that nobody knows any proposition to be true, it can be dismissed. Furthermore, because these propositions entail theexistenceof material objects, idealism, according to which the world is wholly mental, can also be rejected. Moore called this outlook “the common sense view of the world,” and he insisted that any philosophical system whose propositions contravene it can be rejected out of hand without further analysis.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:05.629Z",
      "updatedAt": "2025-04-26T21:52:05.629Z",
      "images": []
    },
    {
      "contentId": "c169570a-fc81-4145-b48d-7e3d4562002c",
      "contentName": "The formalist tradition",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "5bb3272c-d4c9-4f2e-b4e4-4579beada04d",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:05.039Z",
      "updatedAt": "2025-04-26T21:52:05.039Z",
      "images": []
    },
    {
      "contentId": "c5f5451f-5379-4674-bef0-2773fd95c898",
      "contentName": "Identity theory, functionalism, and eliminative materialism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "c169570a-fc81-4145-b48d-7e3d4562002c",
      "content": "Logical positivism and naturalized epistemology were forms of materialism. Beginning about 1970, these approaches were applied to the human mind, giving rise to three general viewpoints: identity theory,functionalism, and eliminative materialism. Identity theory is the view that mental states are identical to physical states of the brain. According to functionalism, a particular mental state is any type of (physical) state that plays a certain causal role with respect to other mental and physical states. For example, pain can be functionally defined as any state that is an effect of events such as cuts and burns and that is a cause of mental states such as fear and behaviour, such as saying “Ouch!” Eliminative materialism is the view that the familiar categories of “folk psychology”—such as belief, intention, and desire—do not refer to anything real. In other words, there are no such things as beliefs, intentions, or desires; instead, there is simply neural activity in the brain. According to the eliminative materialist, a modern scientific account of the mind no more requires the categories offolk psychologythan modern chemistry requires thediscardednotion of phlogiston. A complete account of human mental experience can be achieved simply by describing how the brain operates.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:02.932Z",
      "updatedAt": "2025-04-26T21:52:02.932Z",
      "images": []
    },
    {
      "contentId": "d443b220-2065-4d1d-9a21-aa29c55696ed",
      "contentName": "Naturalized epistemology",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "c169570a-fc81-4145-b48d-7e3d4562002c",
      "content": "The philosophicalpsychologyandphilosophy of minddeveloped since the 1950s by the American philosopherWillard Van Orman Quine(1908–2000), known generally as naturalized epistemology, was influenced both by Russell’s work in logic and by logical positivism. Quine’s philosophy forms acomprehensivesystem that is scientistic, empiricist, and behaviourist (seebehaviourism). Indeed, for Quine the basic task of an empiricist philosophy is simply to describe how our scientific theories about the world—as well as our prescientific, or intuitive, picture of it—are derived from experience. As he wrote:\nThe stimulation of his sensory receptors is all the evidence anybody has had to go on, ultimately, in arriving at his picture of the world. Why not just see how this construction really proceeds? Why not settle for psychology?\nAlthough Quine shared the logical postivists’ scientism and empiricism, he crucially differed from them in rejecting the traditionalanalytic-synthetic distinction. For Quine this distinction is ill-founded because it is not required by any adequate psychological account of how scientific (or prescientific) theories are formulated. Quine’s views had an enormous impact onanalytic philosophy, and until his death at the end of the century, he was generally regarded as the dominant figure in the movement.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:02.663Z",
      "updatedAt": "2025-04-26T21:52:02.663Z",
      "images": []
    },
    {
      "contentId": "ae199f61-610a-4ed6-97c9-e0f1e4313f96",
      "contentName": "Logical positivism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "c169570a-fc81-4145-b48d-7e3d4562002c",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:02.027Z",
      "updatedAt": "2025-04-26T21:52:02.027Z",
      "images": []
    },
    {
      "contentId": "aa3e8b8f-4c42-40f5-9024-7533c466e8ef",
      "contentName": "Logical atomism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "c169570a-fc81-4145-b48d-7e3d4562002c",
      "content": "The first major development in the formalist tradition was ametaphysicaltheory known aslogical atomism, which was derived from work in mathematical logic by the English philosopherBertrand Russell(1872–1970). Russell’s work in turn was based in part on early notebooks written beforeWorld War Iby his former pupilLudwig Wittgenstein(1889–1953). In “The Philosophy of Logical Atomism,” a monograph published in 1918–19, Russell gave credit to Wittgenstein for supplying “many of the theories” contained in it. Wittgenstein had joined the Austrian army when the war broke out, and Russell had been out of contact with him ever since. Wittgenstein thus did not become aware of Russell’s version of logical atomism until after the war. Wittgenstein’s polished and verysophisticatedversion appeared in theTractatus Logico-Philosophicus,which he wrote during the war but did not publish until 1922.\nBoth Russell and Wittgenstein believed that mathematical logic could reveal the basic structure of reality, a structure that is hidden beneath the cloak of ordinary language. In their view, the new logic showed that the world is made up of simple, or “atomic,” facts, which in turn are made up of particular objects. Atomic facts are complex mind-independent features of reality, such as the fact that a particular rock is white or the fact that the Moon is a satellite of Earth. As Wittgenstein says in theTractatus,“The world is determined by the facts, and by their beingallthe facts.” Both Russell and Wittgenstein held that the basic propositions of logic, which Wittgenstein called “elementary propositions,” refer to atomic facts. There is thus an immediate connection between formal languages, such as the logical system of Russell’sPrincipia Mathematica(written with Alfred North Whitehead and published between 1910 and 1913), and the structure of the real world: elementary propositions represent atomic facts, which areconstitutedby particular objects, which are the meanings of logically proper names. Russell differed from Wittgenstein in that he held that the meanings of proper names are “sense data,” or immediate perceptual experiences, rather than particular objects. Further, for Wittgenstein but not for Russell, elementary propositions are connected to the world by being structurally isomorphic to atomic facts—i.e., by being a “picture” of them. Wittgenstein’s view thus came to be known as the “picture theory” of meaning.\nLogical atomism rested upon a number of theses. It was realistic, as distinct from idealistic, in its contention that there are mind-independent facts. But it presupposed that language is mind-dependent—i.e., that language would not exist unless there weresentientbeings who used sounds and marks to refer and to communicate. Logical atomism was thus a dualisticmetaphysicsthat described both the structure of the world and the conditions that any particular language must satisfy in order to represent it. Although its career was brief, its guiding principle—that philosophy should be scientific and grounded in mathematical logic—was widely acknowledged throughout the century.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:01.724Z",
      "updatedAt": "2025-04-26T21:52:01.724Z",
      "images": []
    },
    {
      "contentId": "900386b8-2d15-40cf-b420-9ef322503705",
      "contentName": "Western Marxism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "9d346409-dbed-4de7-ac35-cf74b033c8e7",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:52:01.058Z",
      "updatedAt": "2025-04-26T21:52:01.058Z",
      "images": []
    },
    {
      "contentId": "b04e0426-b1fc-446f-9ee3-4d4dbc8255c1",
      "contentName": "Bergson, Dewey, and Whitehead",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "9d346409-dbed-4de7-ac35-cf74b033c8e7",
      "content": "In hisAn Introduction to Metaphysics(1903) and in his masterpiece,Creative Evolution(1907), Bergson distinguished between two profoundly different ways of knowing: the method of analysis, which is characteristic of science, and the method ofintuition, a kind of intellectual sympathy through which it is possible to enter into objects and other persons and identify with them. All basicmetaphysicaltruths, Bergson held, are grasped by philosophicalintuition. This is how one comes to know one’s deepest self and the essence of all living things, which he called “duration,” as well as the “vital spirit,” which is the mysterious creative agency in the world.\nFor Whitehead, philosophy is primarilymetaphysics, or “speculative philosophy,” which he described as the effort “to frame acoherent, logical, necessary system of general ideas in terms of which every element of our experience can be interpreted.” Whitehead’s philosophy was thus an attempt to survey the world with a large generality of understanding, an end toward which his great trilogy—Science and the Modern World(1925),Process and Reality(1929), andAdventures of Ideas(1933)—was directed.\nWhereas Bergson and Whitehead were principally metaphysicians and philosophers ofculture, Dewey was a generalist who stressed the unity, interrelationship, and organicity of all forms of philosophical knowledge. He is chiefly notable for the fact that hisconceptionof philosophy stressed so powerfully the notions of practicality andmoralpurpose. One of the guiding aims of Dewey’s philosophizing was the effort to find the same warranted assertibility forethicaland political judgments as for scientific ones. Philosophy, he said, should be oriented not to professional pride but to human need.\nDewey’s approach to the social problems of the 20th century, unlike that ofVladimir Lenin(1870–1924), emphasized not revolution but the continuous application of the intellect to social affairs. He believed in social planning—in conscious intelligent intervention to produce desirable social change—and he proposed a new “experimentalism” as a guide toenlightenedpublic action to promote the aims of a democraticcommunity. Hispragmaticsocial theory is the first major political philosophy produced by modernliberal democracy.",
      "imagesId": [
        "4c38335b-bd78-44cf-89db-298ea4bcecc6",
        "fdf38af5-5df7-4253-a8ea-dcded9a821c1"
      ],
      "createdAt": "2025-04-26T21:52:00.807Z",
      "updatedAt": "2025-04-26T21:52:00.807Z",
      "images": [
        {
          "imageId": "4c38335b-bd78-44cf-89db-298ea4bcecc6",
          "contentId": "b04e0426-b1fc-446f-9ee3-4d4dbc8255c1",
          "src": "https://cdn.britannica.com/48/13148-004-B6F6F381/Henri-Bergson-1928.jpg?w=300",
          "alt": "Henri Bergson",
          "caption": "Henri BergsonHenri Bergson, 1928.(more)",
          "width": 210,
          "height": 300,
          "createdAt": "2025-04-26T21:52:00.807Z",
          "updatedAt": "2025-04-26T21:52:00.807Z"
        },
        {
          "imageId": "fdf38af5-5df7-4253-a8ea-dcded9a821c1",
          "contentId": "b04e0426-b1fc-446f-9ee3-4d4dbc8255c1",
          "src": "https://cdn.britannica.com/92/41492-004-B3BF20CB/Alfred-North-Whitehead.jpg?w=300",
          "alt": "Alfred North Whitehead",
          "caption": "Alfred North Whitehead(more)",
          "width": 400,
          "height": 450,
          "createdAt": "2025-04-26T21:52:00.807Z",
          "updatedAt": "2025-04-26T21:52:00.807Z"
        }
      ]
    },
    {
      "contentId": "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
      "contentName": "Modern philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": null,
      "content": "",
      "imagesId": [
        "4bf87d02-48f2-498d-b17f-390d1bd0e7e3",
        "31f2eec8-06d8-4b09-8d2e-e19c3dde91c1"
      ],
      "createdAt": "2025-04-26T21:52:00.561Z",
      "updatedAt": "2025-04-26T21:52:00.561Z",
      "images": [
        {
          "imageId": "4bf87d02-48f2-498d-b17f-390d1bd0e7e3",
          "contentId": "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
          "src": "https://cdn.britannica.com/15/58715-050-5BA24064/Francis-Bacon-oil-painting-artist-National-Portrait.jpg?w=300",
          "alt": "Francis Bacon",
          "caption": "Francis BaconFrancis Bacon, oil painting by an unknown artist; in the National Portrait Gallery, London.(more)",
          "width": 1002,
          "height": 1600,
          "createdAt": "2025-04-26T21:52:00.561Z",
          "updatedAt": "2025-04-26T21:52:00.561Z"
        },
        {
          "imageId": "31f2eec8-06d8-4b09-8d2e-e19c3dde91c1",
          "contentId": "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
          "src": "https://cdn.britannica.com/03/11003-050-CB252C79/Thomas-Hobbes-detail-oil-painting-John-Michael.jpg?w=300",
          "alt": "English philosopher Thomas Hobbes",
          "caption": "English philosopher Thomas HobbesThomas Hobbes, detail of an oil painting by John Michael Wright; in the National Portrait Gallery, London.(more)",
          "width": 1306,
          "height": 1600,
          "createdAt": "2025-04-26T21:52:00.561Z",
          "updatedAt": "2025-04-26T21:52:00.561Z"
        }
      ]
    },
    {
      "contentId": "0a3f58bd-79bb-4584-b4b8-ffe27db579d6",
      "contentName": "The 19th century",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:58.808Z",
      "updatedAt": "2025-04-26T21:51:58.808Z",
      "images": []
    },
    {
      "contentId": "b3777f62-54b5-41ee-ad26-33e2578a585a",
      "contentName": "Independent and irrationalist movements",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "0a3f58bd-79bb-4584-b4b8-ffe27db579d6",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:57.045Z",
      "updatedAt": "2025-04-26T21:51:57.045Z",
      "images": []
    },
    {
      "contentId": "1ad2dfee-3678-49ac-85c2-323d8af5d7b7",
      "contentName": "Positivism and social theory in Comte, Mill, and Marx",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "0a3f58bd-79bb-4584-b4b8-ffe27db579d6",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:56.778Z",
      "updatedAt": "2025-04-26T21:51:56.778Z",
      "images": []
    },
    {
      "contentId": "6bfabde9-2d8e-4399-839d-0389be94c6dd",
      "contentName": "The idealism of Fichte, Schelling, and Hegel",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "0a3f58bd-79bb-4584-b4b8-ffe27db579d6",
      "content": "The Enlightenment, inspired by the example of natural science, had accepted certain boundaries to human knowledge; that is, it had recognized certain limits to reason’s ability to penetrate ultimate reality because that would require methods that surpass the capabilities ofscientific method. In this particular modesty, the philosophies of Hume and Kant were much alike. But in the early 19th century themetaphysicalspirit returned in a most ambitious and extravagant form. German idealism reinstated the most speculative pretensions of Leibniz and Spinoza. This development was due in part to the influence of Romanticism but also, and more importantly, to a new alliance of philosophy with religion. It was not a coincidence that all the great German idealists were either former students of theology—Fichte at Jena and Leipzig (1780–84), Schelling and Hegel at the Tübingen seminary (1788–95)—or the sons of Protestant pastors. It is probably this circumstance that gave to German idealism its intensely serious, quasi-religious, and dedicated character.\nThe consequence of this religious alignment was that philosophical interest shifted from Kant’sCritique of Pure Reason(in which he had attempted to account for natural science and denied the possibility of certainty in metaphysics) to hisCritique of Practical Reason(in which he had explored the nature of themoralself) and hisCritique of Judgment(in which he had treated of the purposiveness of the universe as a whole). Absolute idealism was based upon three premises:\nThus, for idealisticmetaphysics, the primary task of philosophy was understanding the self, self-consciousness, and the spiritual universe.\nThe philosophies of Fichte, Schelling, and Hegel had much in common. Fichte, professor of philosophy at the newly foundedUniversity of Berlin(1809–14),combinedin a workable unity the subjectivism of Descartes, the cosmic monism of Spinoza, and the moral intensity of Kant. He conceived of human self-consciousness as the primary metaphysical fact through the analysis of which the philosopher finds his way to the cosmic totality that is “theAbsolute.” Just as the moral will is the chief characteristic of the self, so it is also the activating principle of the world. Thus Fichte provided a new definition of philosophizing that made it the most dignified of intellectual pursuits. The sole task of philosophy is “the clarification of consciousness,” and the highest degree of self-consciousness is achieved by philosophers because they alone recognize “Mind,” or “Spirit,” as the central principle of reality.\nThis line of thought was carried further by Georg Wilhelm Friedrich Hegel, Fichte’s successor at Berlin and perhaps the single mostcomprehensiveand influential thinker of the 19th century. Kant’s problem had been the critical examination of reason’s role in human experience. For Hegel, too, the function of philosophy is to discover the place of reason in nature, in experience, and in reality—to understand the laws according to which reason operates in the world. But whereas Kant had found reason to be the form that mind imposes on the world, Hegel found it to be constitutive of the world itself—not something that mind imposes but something it discovers. Just as Fichte had projected consciousness from mind to reality, so Hegel projected reason. The resulting Hegelian pronouncements—that “the rational is the real” and that “thetruthis the whole”—although they express an organic theory of truth and reality, tended to blur the usual distinctions that previous philosophers had made betweenlogicandmetaphysics, between subject and object, and between thought and existence; for the basic tenet of idealism, that reality is spiritual, generates just such a vague inclusiveness.\nTo the Fichtean foundations, however, Hegel added one crucial corollary: that the Absolute, or Whole, which is aconcreteuniversal entity, is not static but undergoes a crucial development over time. Hegel called this evolution “thedialecticalprocess” (seedialectic). By stressing it, Hegel accomplished two things: (1) he indicated that reason itself is not eternal but “historical,” and (2) he thereby gave new meaning and relevance to the changing conditions of human society in history—which added to the philosophical task a culturaldimensionthat it had not possessed before.\nThe philosopher’s vocation, in Hegel’s view, is to approach the Absolute through consciousness—to recognize it as Spirit expressing and developing itself (“realizing itself” was his own phrase) in all the manifold facets of human life. Struggle is the essence of spiritualexistence, and self-enlargement is its goal. For these reasons, the various branches of intellect and culture, enumerated below, become stages in the unfolding of the “World-Spirit”:\nTherefore, what began in Hegel as a metaphysics of the Absolute ended by becoming a total philosophy of human culture.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:55.984Z",
      "updatedAt": "2025-04-26T21:51:55.984Z",
      "images": []
    },
    {
      "contentId": "daeb118f-d359-4e6b-ad0c-fcf0c5c03926",
      "contentName": "The Enlightenment",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:55.378Z",
      "updatedAt": "2025-04-26T21:51:55.378Z",
      "images": []
    },
    {
      "contentId": "638dbd49-c0e3-4722-8dea-b8f31f4c9fdc",
      "contentName": "Literary forms",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "daeb118f-d359-4e6b-ad0c-fcf0c5c03926",
      "content": "The literary form of Enlightenment philosophizing was simple and straightforward. Except for an occasional reversion to thedialogueform, as in Berkeley’sThree Dialogues Between Hylas and Philonous(1713) and in Hume’sDialogues Concerning Natural Religion(1779), it consisted of inquiries, discourses,treatises, dissertations, and essays, generally well written in clear, relatively nontechnical prose. But Kant not only introduced aformidabletechnical philosophical terminology into his works but was, in fact, the originator of a new philosophical form—the “critique” or “critical examination”—that had its own special architectonics. Each of Kant’s threecritiquesis divided into the same three parts: (1) an “analytic,” or analysis of reason’s right functioning, (2) a “dialectic,” orlogicof error, showing the pitfalls into which a careless reason falls, and (3) a “methodology,” an arrangement of rules for practice. It is a form that was unique to Kant, but it raised certain problems of “oppositional” thinking, to which 19th-century philosophers such asGeorg Wilhelm Friedrich Hegel,Arthur Schopenhauer, andSøren Kierkegaardwere subsequently to turn.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:53.605Z",
      "updatedAt": "2025-04-26T21:51:53.605Z",
      "images": []
    },
    {
      "contentId": "8d83195a-d84e-4833-bbdc-b9c480250bf5",
      "contentName": "Critical examination of reason in Kant",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "daeb118f-d359-4e6b-ad0c-fcf0c5c03926",
      "content": "All these developments led directly to the philosophy ofImmanuel Kant, the greatest philosopher of the modern period, whose works mark the true culmination of the philosophy of the Enlightenment. Historically speaking, Kant’s great contribution was to elucidate both the sensory and thea priorielements in knowledge and thus to bridge the gap between the extremerationalismof Leibniz and the extremeempiricismof Hume. But in addition to the brilliant content of his philosophical doctrines, Kant was responsible for three crucial philosophical innovations: (1) a new definition of philosophy, (2) a newconceptionof philosophicalmethod, and (3) a new structural model for the writing of philosophy.\nKant conceived ofreasonas being at the very heart of the philosophical enterprise. Philosophy’s sole task, in his view, is to determine what reason can and cannot do. Philosophy, he said, “is thescienceof the relation of all knowledge to the essential ends of human reason”; its true aim is both constructive (“to outline the system of all knowledge arising from pure reason”) and critical (“to expose theillusionsof a reason that forgets its limits”). Philosophy is thus a calling of great dignity, for its aim is wisdom, and its practitioners are themselves “lawgivers of reason.” But in order for philosophy to be “the science of the highest maxims of reason,” the philosopher must be able to determine the source, the extent, and the validity of human knowledge and the ultimate limits of reason. And these tasks require a special philosophical method.\nSometimes Kant called this the “transcendental method,” but more often the “critical method.” His purpose was to reject thedogmaticassumptions of the rationalist school, and his wish was to return to the semiskeptical position with which Descartes had begun before his dogmatic pretensions to certainty took hold. Kant’s method was to conduct a critical examination of the powers of a priori reason—an inquiry into what reason can achieve when all experience is removed. His method was based on a doctrine that he himself called “a Copernican revolution” in philosophy (byanalogywith the shift from geocentrism to heliocentrism in cosmology): the assumption that objects must conform to human knowledge—or to the human apparatus of knowing—rather than that human knowledge must conform to objects. The question then became: What is the exact nature of this knowing apparatus?\nUnlike Descartes, Kant could not question that knowledge exists. No one raised in the Enlightenment could doubt, for example, that mathematics and Newtonianphysicswere real. Kant’s methodological question was rather: How is mathematical and physical knowledge possible? How must human knowledge be structured in order to make these sciences secure? The attempt to answer these questions was the task of Kant’s great workCritique of Pure Reason(1781).\nKant’s aim was to examine reason not merely in one of its domains but in each of its employments according to the threefold structure of the human mind that he had inherited from Wolff. Thus the critical examination of reason in thinking (science) is undertaken in theCritique of Pure Reason, that of reason in willing (ethics) in theCritique of Practical Reason(1788), and that of reason in feeling (aesthetics) in theCritique of Judgment(1790).",
      "imagesId": [
        "51840754-cacb-497d-93d4-d909a97adb24"
      ],
      "createdAt": "2025-04-26T21:51:53.365Z",
      "updatedAt": "2025-04-26T21:51:53.365Z",
      "images": [
        {
          "imageId": "51840754-cacb-497d-93d4-d909a97adb24",
          "contentId": "8d83195a-d84e-4833-bbdc-b9c480250bf5",
          "src": "https://cdn.britannica.com/74/102174-050-79127006/Immanuel-Kant-print-London-1812.jpg?w=300",
          "alt": "Immanuel Kant",
          "caption": "Immanuel KantImmanuel Kant, print published in London, 1812.(more)",
          "width": 1066,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:53.365Z",
          "updatedAt": "2025-04-26T21:51:53.365Z"
        }
      ]
    },
    {
      "contentId": "49a55e41-26a3-44c2-8abb-0e6ba945f4df",
      "contentName": "Nonepistemological movements in the Enlightenment",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "daeb118f-d359-4e6b-ad0c-fcf0c5c03926",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:53.113Z",
      "updatedAt": "2025-04-26T21:51:53.113Z",
      "images": []
    },
    {
      "contentId": "ee8a4beb-839b-4de7-a033-1f21c2c48ca3",
      "contentName": "Professionalization of philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "49a55e41-26a3-44c2-8abb-0e6ba945f4df",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:51.365Z",
      "updatedAt": "2025-04-26T21:51:51.365Z",
      "images": []
    },
    {
      "contentId": "adbfbdc6-29e7-4221-8e12-478ff7cb824c",
      "contentName": "Social and political philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "49a55e41-26a3-44c2-8abb-0e6ba945f4df",
      "content": "Apart fromepistemology, the most significant philosophical contributions of the Enlightenment were made in the fields of social and political philosophy. TheTwo Treatises of Civil Government(1690) by Locke andThe Social Contract(1762) byJean-Jacques Rousseau(1712–78) proposed justifications of political association grounded in the newer political requirements of the age. The Renaissance political philosophies of Machiavelli, Bodin, and Hobbes had presupposed or defended theabsolutepower of kings and rulers. But the Enlightenment theories of Locke and Rousseau championed the freedom and equality of citizens. It was a natural historical transformation. The 16th and 17th centuries were the age of absolutism; the chief problem of politics was that of maintaining internal order, and political theory was conducted in the language of nationalsovereignty. But the 18th century was the age of the democratic revolutions; the chief political problem was that of securing freedom and revolting against injustice, and political theory was expressed in theidiomof natural and inalienable rights.\nLocke’s political philosophy explicitly denied thedivine right of kingsand the absolute power of thesovereign. Instead, he insisted on a natural and universal right to freedom and equality. Thestate of naturein which human beings originally lived was not, as Hobbes imagined, intolerable, though it did have certain inconveniences. Therefore, people banded together to form society—asAristotletaught, “not simply to live, but to live well.” Political power, Locke argued, can never be exercised apart from its ultimate purpose, which is thecommon good, for the political contract is undertaken in order to preserve life, liberty, and property.\nLocke thus stated one of the fundamental principles of politicalliberalism: that there can be no subjection to power withoutconsent—though once political society has been founded, citizens are obligated to accept the decisions of a majority of their number. Such decisions are made on behalf of the majority by the legislature, though the ultimate power of choosing the legislature rests with the people; and even the powers of the legislature are not absolute, because thelaw of natureremains as a permanent standard and as a principle of protection against arbitrary authority.\nRousseau’s more radical political doctrines were built upon Lockean foundations. For him, too, the convention of the social contract formed the basis of alllegitimatepolitical authority, though hisconceptionofcitizenshipwas much more organic and much less individualistic than Locke’s. The surrender of natural liberty forcivil libertymeans that all individual rights (among them property rights) become subordinate to thegeneral will. For Rousseau thestateis amoralperson whose life is the union of its members, whose laws are acts of the general will, and whose end is the liberty and equality of its citizens. It follows that when any government usurps the power of the people, the social contract is broken; and not only are the citizens no longer compelled to obey, but they also have an obligation to rebel. Rousseau’s defiantcollectivismwas clearly a revolt against Locke’s systematicindividualism; for Rousseau the fundamental category was not “natural person” but “citizen.” Nevertheless, however much they differed, in these two social theorists of the Enlightenment is to be found the germ of all modernliberalism: its faith inrepresentative democracy, in civil liberties, and in the basic dignity of human beings.",
      "imagesId": [
        "7fe3bab2-cbe5-434f-b54a-d95d2016aa08"
      ],
      "createdAt": "2025-04-26T21:51:50.768Z",
      "updatedAt": "2025-04-26T21:51:50.768Z",
      "images": [
        {
          "imageId": "7fe3bab2-cbe5-434f-b54a-d95d2016aa08",
          "contentId": "adbfbdc6-29e7-4221-8e12-478ff7cb824c",
          "src": "https://cdn.britannica.com/18/60018-050-E8F7CB20/Jean-Jacques-Rousseau-pastels-Maurice-Quentin-de-La-Tour-1753.jpg?w=300",
          "alt": "Jean-Jacques Rousseau",
          "caption": "Jean-Jacques RousseauJean-Jacques Rousseau, drawing in pastels by Maurice-Quentin de La Tour, 1753; in the Musée d'Art et d'Histoire, Geneva.(more)",
          "width": 1172,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:50.769Z",
          "updatedAt": "2025-04-26T21:51:50.769Z"
        }
      ]
    },
    {
      "contentId": "0912ef3d-d096-4844-8dc8-5c54cb0bce91",
      "contentName": "Materialism and scientific discovery",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "49a55e41-26a3-44c2-8abb-0e6ba945f4df",
      "content": "The profound influence of Locke spread to France, where it not only resulted in the skeptical empiricism ofVoltaire(1694–1778) but also united with mechanistic aspects ofCartesianismto produce an entire school of sensationalistic materialism. Representative works includedMan a Machine(1747) byJulien Offroy de La Mettrie(1709–51),Treatise on the Sensations(1754) byÉtienne Bonnot de Condillac(1715–80), andThe System of Nature(1770) byPaul-Henri Dietrich, baron d’Holbach(1723–89). This position even found its way into many of the articles of the great FrenchEncyclopédie, edited byDenis Diderot(1713–84) andJean d’Alembert(1717–83), which was almost a complete compendium of the scientific and humanistic accomplishments of the 18th century.\nAlthough the terms Middle Ages and Renaissance were not invented until well after the historical periods theydesignate, scholars of the 18th century called their age “the Enlightenment” with self-conscious enthusiasm and pride. It was an age of optimism and expectations of new beginnings. Great strides were made inchemistryandbiologicalscience.Jean-Baptiste de Monet, chevalier de Lamarck(1744–1829),Georges, Baron Cuvier(1769–1832), andGeorges-Louis Leclerc, comte de Buffon(1707–88), introduced a new system of animal classification. In the eight years between 1766 and 1774, three chemical elements—hydrogen, nitrogen, and oxygen—were discovered. Foundations were being laid inpsychologyand the social sciences and inethicsandaesthetics. The work ofAnne-Robert-Jacques Turgot, baron de L’Aulne(1727–81), andMontesquieu(1689–1755) in France,Giambattista Vico(1668–1744) in Italy, andAdam Smith(1723–90) in Scotland marked the beginning ofeconomics, politics, history,sociology, and jurisprudence as sciences. Hume, the utilitarian philosopherJeremy Bentham(1748–1832), and the British “moral sense” theorists were turningethicsinto a specialized field of philosophical inquiry. AndAnthony Ashley, 3rd earl of Shaftesbury(1671–1713),Edmund Burke(1729–97),Johann Gottsched(1700–66), andAlexander Baumgarten(1714–62) were laying the foundations for a systematicaesthetics.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:50.181Z",
      "updatedAt": "2025-04-26T21:51:50.181Z",
      "images": []
    },
    {
      "contentId": "44910306-8e0b-4d98-bb92-69ccf44b5c41",
      "contentName": "Classical British empiricism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "daeb118f-d359-4e6b-ad0c-fcf0c5c03926",
      "content": "",
      "imagesId": [
        "c346044e-9690-4ad5-a9af-37659b95243e",
        "e366a1ae-8fa6-455c-b34e-81dd482baadb",
        "a6fba45f-5e0f-4f4f-a23a-a01e8a5cf823"
      ],
      "createdAt": "2025-04-26T21:51:49.591Z",
      "updatedAt": "2025-04-26T21:51:49.591Z",
      "images": [
        {
          "imageId": "c346044e-9690-4ad5-a9af-37659b95243e",
          "contentId": "44910306-8e0b-4d98-bb92-69ccf44b5c41",
          "src": "https://cdn.britannica.com/99/82299-050-023B9807/John-Locke-oil-canvas-Herman-Verelst-National.jpg?w=300",
          "alt": "John Locke",
          "caption": "John LockeThe philosopher John Locke, oil on canvas by Herman Verelst, 1689; in the National Portrait Gallery, London.(more)",
          "width": 1378,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:49.592Z",
          "updatedAt": "2025-04-26T21:51:49.592Z"
        },
        {
          "imageId": "e366a1ae-8fa6-455c-b34e-81dd482baadb",
          "contentId": "44910306-8e0b-4d98-bb92-69ccf44b5c41",
          "src": "https://cdn.britannica.com/07/29907-050-572BA52D/George-Berkeley-detail-oil-painting-John-Smibert-1732.jpg?w=300",
          "alt": "George Berkeley",
          "caption": "George BerkeleyGeorge Berkeley, detail of an oil painting by John Smibert, c. 1732; in the National Portrait Gallery, London.(more)",
          "width": 1179,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:49.592Z",
          "updatedAt": "2025-04-26T21:51:49.592Z"
        },
        {
          "imageId": "a6fba45f-5e0f-4f4f-a23a-a01e8a5cf823",
          "contentId": "44910306-8e0b-4d98-bb92-69ccf44b5c41",
          "src": "https://cdn.britannica.com/98/51398-050-8E6A167C/David-Hume-oil-painting-Allan-Ramsay-Scottish-1766.jpg?w=300",
          "alt": "Scottish philosopher David Hume",
          "caption": "Scottish philosopher David HumeDavid Hume, oil painting by Allan Ramsay, 1766; in the Scottish National Portrait Gallery, Edinburgh.(more)",
          "width": 1322,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:49.592Z",
          "updatedAt": "2025-04-26T21:51:49.592Z"
        }
      ]
    },
    {
      "contentId": "ab057ca6-7503-4421-bcb1-e63fd44f86db",
      "contentName": "Introduction",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": null,
      "content": "Western philosophyencompassesthe history of philosophy in the West from its development among theancient GreeksofClassical antiquityto the present.\nThis article has three basic purposes: (1) to provide an overview of the history ofphilosophyin the West, (2) to relate philosophical ideas and movements to their historical background and to the cultural history of their time, and (3) to trace the changingconceptionof the definition, the function, and the task of philosophy.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:50:57.151Z",
      "updatedAt": "2025-04-26T21:50:57.151Z",
      "images": []
    },
    {
      "contentId": "84ec2dda-193e-46a6-923b-a9bfe15b8c62",
      "contentName": "Basic science of human nature in Hume",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "44910306-8e0b-4d98-bb92-69ccf44b5c41",
      "content": "The third, and in many ways the most important, of the British empiricists was theskepticDavid Hume. Hume’s philosophical intention was to reap, humanistically, the harvest sowed by Newtonianphysics, to apply themethodof naturalscienceto human nature. The paradoxical result of this admirable goal, however, was askepticalcrisis even more devastating than that of the early French Renaissance.\nHume followed Locke and Berkeley in approaching the problem of knowledge from a psychological perspective. He too found the origin of knowledge in sense experience. But whereas Locke had found a certain trustworthy order in the compounding power of themind, and Berkeley had found mentality itself expressive of a certain spiritual power, Hume’s relentless analysis discovered as muchcontingencyin mind as in the external world. All uniformity in perceptual experience, he held, comes from “an associating quality of the mind.” The “associationof ideas” is a fact, but the relations of resemblance, contiguity, andcause and effectthat it produces have no intrinsic validity because they are merely the product of “mental habit.” Thus, the causal principle upon which allknowledgerests represents no necessary connections between things but is simply the result of their constant conjunction in human minds. Moreover, the mind itself, far from being an independent power, is simply “a bundle of perceptions” without unity orcohesivequality. Hume’s denial of a necessary order of nature on the one hand and of a substantial or unified self on the other precipitated a philosophical crisis from which Enlightenment philosophy was not to be rescued until the work of Kant.",
      "imagesId": [
        "6d80245c-44f1-4b10-b3db-908577104391"
      ],
      "createdAt": "2025-04-26T21:51:47.833Z",
      "updatedAt": "2025-04-26T21:51:47.833Z",
      "images": [
        {
          "imageId": "6d80245c-44f1-4b10-b3db-908577104391",
          "contentId": "84ec2dda-193e-46a6-923b-a9bfe15b8c62",
          "src": "https://cdn.britannica.com/98/51398-050-8E6A167C/David-Hume-oil-painting-Allan-Ramsay-Scottish-1766.jpg?w=300",
          "alt": "Scottish philosopher David Hume",
          "caption": "Scottish philosopher David HumeDavid Hume, oil painting by Allan Ramsay, 1766; in the Scottish National Portrait Gallery, Edinburgh.(more)",
          "width": 1322,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:47.833Z",
          "updatedAt": "2025-04-26T21:51:47.833Z"
        }
      ]
    },
    {
      "contentId": "8ad159c1-5b3a-4158-b85c-9f7d3509e879",
      "contentName": "Reason in Locke and Berkeley",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "44910306-8e0b-4d98-bb92-69ccf44b5c41",
      "content": "Locke’sAn Essay Concerning Human Understandingmarked a decisively new direction for modern philosophizing because it proposed what amounts to a newcriterionoftruth. Locke’s aim in his essay—“to inquire into the origin, certainty, and extent of human knowledge”—involved three tasks:\nWhat was crucial for Locke, however, was that the second task is dependent upon the first. Following the general Renaissance custom, Locke defined anideaas a mental entity: “whatever is the object of the understanding when a man thinks.” But whereas for Descartes and the entire rationalist school the certainty of ideas had been a function of their self-evidence—i.e., of their clarity and distinctness—for Locke their validity depended expressly on the mode and manner of their origin. Thus, anintrinsiccriterion of truth and validity was replaced with a genetic one.\nLocke’s exhaustive survey of mental contents is useful, if elaborate. Although he distinguished between ideas ofsensationand ideas ofreflection, the thrust of his efforts and those of his empiricist followers was to reduce the latter to the former, to minimize the originative power of the mind in favour of its passive receptivity to the sensory impressions received from without. Locke’s classification of ideas into “simple” and “complex” was an attempt to distinguish mental contents that are derived directly from one or more of the senses (such as blueness or solidity, which come from a single sense such as sight or touch, and figure, space, extension, rest, and motion, which are the product of several senses combined) from complicated andcompoundedideas of universals (such as triangle and gratitude), substances, and relations (such asidentity,diversity, and cause and effect).\nLocke’sEssaywas a dogged attempt to produce the total world of humanconceptualexperience from a set of elementary sensory building blocks, moving always from sensation toward thought and from the simple to the complex. The basic outcome of his epistemology was therefore:\nLocke’stheory of knowledgewas based upon a kind of sensoryatomism, in which the mind is an agent of discovery rather than of creation, and ideas are “like” the objects they represent, which in turn are the sources of the sensations the mind receives. Locke’s theory also made the important distinction between “primary qualities” (such as solidity, figure, extension, motion, and rest), which are real properties of physical objects, and “secondary qualities” (such as colour, taste, and smell), which are merely the effects of such real properties on the mind.\nIt was precisely thisdualismof primary and secondary qualities that Locke’ssuccessor,George Berkeley, sought to overcome. Although Berkeley was a bishop in the Anglican church who professed a desire to combat atheisticmaterialism, his importance for the theory of knowledge lies rather in the way in which he demonstrated that, in the end, primary qualities are reducible to secondary qualities. Hisempiricismled to a denial of abstract ideas because he believed that general notions are simply fictions of the mind. Science, he argued, can easily dispense with the concept of matter: nature is simply that which human beings perceive through their sense faculties. This means that sense experiences themselves can be considered “objects for the mind.” A physical object, therefore, is simply a recurrent group of sense qualities. With this important reduction ofsubstancetoquality, Berkeley became the father of the epistemological position known asphenomenalism, which has remained an important influence in British philosophy to the present day.",
      "imagesId": [
        "8a98409d-74fa-41d8-bbe1-ebfbf1683774"
      ],
      "createdAt": "2025-04-26T21:51:47.567Z",
      "updatedAt": "2025-04-26T21:51:47.567Z",
      "images": [
        {
          "imageId": "8a98409d-74fa-41d8-bbe1-ebfbf1683774",
          "contentId": "8ad159c1-5b3a-4158-b85c-9f7d3509e879",
          "src": "https://cdn.britannica.com/07/29907-050-572BA52D/George-Berkeley-detail-oil-painting-John-Smibert-1732.jpg?w=300",
          "alt": "George Berkeley",
          "caption": "George BerkeleyGeorge Berkeley, detail of an oil painting by John Smibert, c. 1732; in the National Portrait Gallery, London.(more)",
          "width": 1179,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:47.568Z",
          "updatedAt": "2025-04-26T21:51:47.568Z"
        }
      ]
    },
    {
      "contentId": "8d7bd44b-59f3-46d7-abed-cf4fca30f307",
      "contentName": "Literary forms and sociological conditions",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
      "content": "The literary forms in which philosophical exposition was couched in the early modern period ranged from the scientificaphorismsof Bacon and the autobiographical meditations of Descartes to the systematic prose of Hobbes and the episodic propositional format of Leibniz. Two basic tendencies, however, can be discerned:\nThe concept of serial order stressed by geometry, in which the reasoner passes deductively from the universal (axioms) to the particular (theorems), influenced, in turn, the style of Hobbes, Descartes, and Spinoza. The organization of Hobbes’sLeviathanand Descartes’sPrinciplesreflects this tendency, while Spinoza’sEthicsutilizes the Euclidean method so formalistically as almost toconstitutean impenetrable barrier to the basic lucidity of his thought.\nMedievalphilosophy was characteristically associated with the medievaluniversity. It is a singular fact, therefore, that from the birth of Bacon in 1561 to the death of the Scottish philosopherDavid Humein 1776—i.e., for more than 200 years—not one first-rate philosophical mind in Europe was permanently associated with a university.\nAs the age of the saint passed into that of the gentleman, the changing social, political, and economic conditions were naturally reflected in the titles,social status, and economic situation of philosophers. Bacon was a lawyer, judge, and attendant upon the royal court; Hobbes was the tutor and companion of young noblemen; Descartes, the son of a noble family, traveled and studied at leisure, eventually retiring to Holland on an inherited income; and Leibniz, courtier, diplomat, and scholar, was a privy councillor and baron of theHoly Roman Empire. Some philosophers also associated with the great monarchs and administrators of the age: Descartes gave philosophical instruction to Queen Christina of Sweden, Leibniz was anintimateof the electress Sophia Charlotte of Prussia (1668–1705), and Spinoza enjoyed the personal friendship of the Dutch politicianJohan de Witt(1625–72). Thus, in the early modern period, philosophers often belonged to the lesser nobility or were closely associated with the higher nobility, to whom—like poets—many of them dedicated their works.\nThus philosophy in the 16th and 17th centuries was clearly the preoccupation of a widely scattered elite. This meant that, despite the existence of printing, much philosophical communication took place within a small and informal circle.Treatiseswere circulated in manuscript, comments and objections were solicited, and a vast polemical correspondence was built up. Prior to its publication, Descartes prudently sent hisMeditationsto the theologians of the Sorbonne for comment; after its publication, his friendMarin Mersenne(1588–1648) sent it to Hobbes,Antoine Arnauld(1612–94), andPierre Gassendi, among others, who returned formal objections to which Descartes in turn replied. The rich philosophical correspondence of the 17th century is exemplified by the letters that passed between Descartes and the scientistChristiaan Huygens(1629–95), between Leibniz and Arnauld, and between Leibniz andSamuel Clarke(1675–1729), which were published in 1717.\nThroughout the early modern period, creative philosophy was sharply separated from formal centres of learning. Hobbes expressed extremecontemptfor theAristotelianismof Oxford; Descartes, despite hisprudence, scorned the medievalists of the Sorbonne; and Spinoza refused the offer of a professorship of philosophy at Heidelberg with politeaversion. It was to be another 100 years before philosophy returned to the universities.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:47.319Z",
      "updatedAt": "2025-04-26T21:51:47.319Z",
      "images": []
    },
    {
      "contentId": "10049eeb-e5ac-4793-8fd5-72fd88db77b3",
      "contentName": "The rise of empiricism and rationalism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d8dc0498-c783-4eb8-89bd-ee6c33af7765",
      "content": "",
      "imagesId": [
        "9d926267-cafb-461e-aad6-754bf1a352e0",
        "2648c444-75dc-4d22-85eb-c0c2bcce9c0d"
      ],
      "createdAt": "2025-04-26T21:51:47.058Z",
      "updatedAt": "2025-04-26T21:51:47.058Z",
      "images": [
        {
          "imageId": "9d926267-cafb-461e-aad6-754bf1a352e0",
          "contentId": "10049eeb-e5ac-4793-8fd5-72fd88db77b3",
          "src": "https://cdn.britannica.com/15/58715-050-5BA24064/Francis-Bacon-oil-painting-artist-National-Portrait.jpg?w=300",
          "alt": "Francis Bacon",
          "caption": "Francis BaconFrancis Bacon, oil painting by an unknown artist; in the National Portrait Gallery, London.(more)",
          "width": 1002,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:47.059Z",
          "updatedAt": "2025-04-26T21:51:47.059Z"
        },
        {
          "imageId": "2648c444-75dc-4d22-85eb-c0c2bcce9c0d",
          "contentId": "10049eeb-e5ac-4793-8fd5-72fd88db77b3",
          "src": "https://cdn.britannica.com/03/11003-050-CB252C79/Thomas-Hobbes-detail-oil-painting-John-Michael.jpg?w=300",
          "alt": "English philosopher Thomas Hobbes",
          "caption": "English philosopher Thomas HobbesThomas Hobbes, detail of an oil painting by John Michael Wright; in the National Portrait Gallery, London.(more)",
          "width": 1306,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:47.059Z",
          "updatedAt": "2025-04-26T21:51:47.059Z"
        }
      ]
    },
    {
      "contentId": "5439f164-aae8-4125-b36e-d38cea0d8068",
      "contentName": "The rationalism of Spinoza and Leibniz",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "10049eeb-e5ac-4793-8fd5-72fd88db77b3",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:45.098Z",
      "updatedAt": "2025-04-26T21:51:45.098Z",
      "images": []
    },
    {
      "contentId": "05a03ea3-c011-4300-8934-9502fe608800",
      "contentName": "The rationalism of Descartes",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "10049eeb-e5ac-4793-8fd5-72fd88db77b3",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:44.485Z",
      "updatedAt": "2025-04-26T21:51:44.485Z",
      "images": []
    },
    {
      "contentId": "bbb8631e-0d9a-42fd-9bcf-0dce97f494cf",
      "contentName": "The materialism of Thomas Hobbes",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "10049eeb-e5ac-4793-8fd5-72fd88db77b3",
      "content": "Thomas Hobbeswas acquainted with both Bacon and Galileo. With the first he shared a strong concern for philosophical method, with the second an overwhelming interest in matter in motion. His philosophical efforts, however, were moreinclusiveand more complete than those of his contemporaries. He was acomprehensivethinker within the scope of an exceedingly narrow set of presuppositions, and he produced one of the most systematic philosophies of the early modern period—an almost completely consistent description of humankind, civil society, and nature according to the tenets of mechanistic materialism.\nHobbes’s account of what philosophy is and ought to be clearly distinguished between content and method. As method, philosophy is simply reasoning or calculating by the use of words as to the causes or effects of phenomena. When a person reasons from causes to effects, he reasons synthetically; when he reasons from effects to causes, he reasons analytically. (Hobbes’s strong inclination toward deduction and geometric proofs favoured arguments of the former type.) Hisdogmaticmetaphysicalassumption was that physical reality consists entirely of matter in motion. The real world is a corporeal universe in constant movement, and phenomena, or events, the causes and effects of which it is the business of philosophy to lay bare, consist of either the action of physical bodies on each other or the quaint effects of physical bodies upon minds. From this assumption follows Hobbes’s classification of the fields that form the content of philosophy: (1)physics, (2)moral philosophy, and (3)civil philosophy. Physics is the science of the motions and actions of physical bodies conceived in terms ofcause and effect.Moralphilosophy (or, more accurately, psychology) is the detailed study of “the passions and perturbations of the mind”—that is, how minds are “moved” by desire,aversion, appetite, fear, anger, and envy. And civil philosophy deals with the concerted actions of people in a commonwealth—how, in detail, the wayward wills of human beings can be constrained by power (i.e., force) to prevent civil disorder and maintain peace.\nHobbes’s philosophy was a bold restatement of Greek atomistic materialism, with applications to the realities of early modern politics that would have seemed strange to its ancient authors. But there are also elements in it that make it characteristically English. Hobbes’s account of language led him to adoptnominalismand to deny the reality ofuniversals. Bacon’s general emphasis on experience also had itsanaloguein Hobbes’s theory that all knowledge arises from sense experiences, all of which are caused by the actions of physical bodies on the sense organs. Empiricism has been a basic and recurrent feature of Britishintellectuallife, and its nominalist andsensationalistroots were already clearly evident in both Bacon and Hobbes.",
      "imagesId": [
        "48a1f911-1105-43cf-a19c-12b7ebe175a3"
      ],
      "createdAt": "2025-04-26T21:51:44.197Z",
      "updatedAt": "2025-04-26T21:51:44.197Z",
      "images": [
        {
          "imageId": "48a1f911-1105-43cf-a19c-12b7ebe175a3",
          "contentId": "bbb8631e-0d9a-42fd-9bcf-0dce97f494cf",
          "src": "https://cdn.britannica.com/03/11003-050-CB252C79/Thomas-Hobbes-detail-oil-painting-John-Michael.jpg?w=300",
          "alt": "English philosopher Thomas Hobbes",
          "caption": "English philosopher Thomas HobbesThomas Hobbes, detail of an oil painting by John Michael Wright; in the National Portrait Gallery, London.(more)",
          "width": 1306,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:44.198Z",
          "updatedAt": "2025-04-26T21:51:44.198Z"
        }
      ]
    },
    {
      "contentId": "5db6afeb-4e55-40a5-b69a-f8931dd7aa2f",
      "contentName": "The empiricism of Francis Bacon",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "10049eeb-e5ac-4793-8fd5-72fd88db77b3",
      "content": "Sir Francis Bacon was the outstanding apostle of Renaissance empiricism. Less an original metaphysician or cosmologist than the advocate of avastnew program for the advancement of learning and the reformation of scientific method, Bacon conceived of philosophy as a new technique of reasoning that would reestablish natural science on a firm foundation. In theAdvancement of Learning(1605), he charted the map of knowledge: history, which depends on the human faculty of memory, poetry, which depends on imagination, and philosophy, which depends on reason. To reason, however, Bacon assigned a completely experiential function. Fifteen years later, in hisNovum Organum, he made this clear: Because, he said, “we have as yet no natural philosophy which is pure,…the true business of philosophy must be…to apply the understanding…to a fresh examination of particulars.” A technique for “the fresh examination of particulars” thusconstitutedhis chief contribution to philosophy.\nBacon’s hope for a new birth of science depended not only on vastly more numerous and varied experiments but primarily on “an entirely differentmethod, order, and process for advancing experience.” This method consisted of the construction of what he called “tables of discovery.” He distinguished three kinds: tables of presence, of absence, and of degree (i.e., in the case of any two properties, such as heat and friction, instances in which they appear together, instances in which one appears without the other, and instances in which their amounts vary proportionately). The ultimate purpose of these tables was to order facts in such a way that the true causes of phenomena (the subject of physics) and the true “forms” of things (the subject of metaphysics—the study of the nature of being) could be inductively established.\nBacon’s empiricism was not raw or unsophisticated. Hisconceptof fact and his belief in the primacy of observation led him to formulate laws and generalizations. Also, his conception of forms was quite un-Platonic: a form for him was not an essence but a permanent geometric or mechanical structure. His enduring place in the history of philosophy lies, however, in his single-minded advocacy of experience as the only source of valid knowledge and in his profound enthusiasm for the perfection of natural science. It is in this sense that “the Baconian spirit” was a source of inspiration for generations of later philosophers and scientists.",
      "imagesId": [
        "68b7303c-1bac-41e6-940e-d370d82fbdb6"
      ],
      "createdAt": "2025-04-26T21:51:43.943Z",
      "updatedAt": "2025-04-26T21:51:43.943Z",
      "images": [
        {
          "imageId": "68b7303c-1bac-41e6-940e-d370d82fbdb6",
          "contentId": "5db6afeb-4e55-40a5-b69a-f8931dd7aa2f",
          "src": "https://cdn.britannica.com/15/58715-050-5BA24064/Francis-Bacon-oil-painting-artist-National-Portrait.jpg?w=300",
          "alt": "Francis Bacon",
          "caption": "Francis BaconFrancis Bacon, oil painting by an unknown artist; in the National Portrait Gallery, London.(more)",
          "width": 1002,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:43.944Z",
          "updatedAt": "2025-04-26T21:51:43.944Z"
        }
      ]
    },
    {
      "contentId": "d2d5dbc5-6da4-4ece-837b-6317ff2d9bae",
      "contentName": "Renaissance philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": null,
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:43.689Z",
      "updatedAt": "2025-04-26T21:51:43.689Z",
      "images": []
    },
    {
      "contentId": "704e8e52-d5f7-4da5-b7e1-d5fd9b42f7ab",
      "contentName": "Philosophy of nature",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d2d5dbc5-6da4-4ece-837b-6317ff2d9bae",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:41.936Z",
      "updatedAt": "2025-04-26T21:51:41.936Z",
      "images": []
    },
    {
      "contentId": "798e40c5-6b9a-48d0-bef6-ded329a75554",
      "contentName": "Humanism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d2d5dbc5-6da4-4ece-837b-6317ff2d9bae",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:41.668Z",
      "updatedAt": "2025-04-26T21:51:41.668Z",
      "images": []
    },
    {
      "contentId": "1557eb2f-c31d-4948-8b89-1de866a1e002",
      "contentName": "Political philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d2d5dbc5-6da4-4ece-837b-6317ff2d9bae",
      "content": "As secular authority replaced ecclesiastical authority and as the dominant interest of the age shifted from religion to politics, it was natural that the rivalries of the national states and their persistent crises of internal order should raise with renewed urgency philosophical problems, practically dormant since pre-Christian times, about the nature and themoralstatus of political power. This new preoccupation with national unity, internal security, state power, and internationaljusticestimulated the growth of political philosophy in Italy, France, England, and Holland.\nMachiavelli, sometime state secretary of the Florentine republic, explored techniques for the seizure and retention of power in ways that seemed to exalt “reasons of state” abovemorality. HisThe PrinceandDiscourses on the First Ten Books of Livy(both published posthumously) codified the actual practices of Renaissance diplomacy for the next 100 years. In fact, Machiavelli was motivated by patriotic hopes for the ultimate unification of Italy and by theconvictionthat the moral standards of contemporary Italians needed to be elevated by restoring the ancient Roman virtues. More than half a century later, the French political philosopherJean Bodin(1530–96) insisted that the state must possess a single, unified, and absolute power; he thus developed in detail the doctrine of nationalsovereigntyas the source of all legal legitimacy.\nIn England, Hobbes, who was to become tutor to the future kingCharles II(1630–85), developed the fiction that, in the “state of nature” that preceded civilization, “every man’s hand [was] raised against every other” and human life was accordingly “solitary, poor, nasty, brutish, and short.” Asocial contractwas thus agreed upon to convey all private rights to a singlesovereignin return for general protection and the institution of a reign oflaw. Because law is simply “the command of the sovereign,” Hobbes at once turnedjusticeinto a by-product ofpowerand denied any right of rebellion except when the sovereign becomes too weak to protect the commonwealth or to hold it together. (See belowThe materialism of Thomas Hobbes.)\nIn Holland, a prosperous and tolerant commercial republic in the 17th century, the issues of political philosophy took a different form. TheDutch East India Companycommissioned a great jurist,Hugo Grotius(1583–1645), to write a defense of their trading rights and their free access to the seas, and the resulting twotreatises,The Freedom of the Seas(1609) andOn the Law of War and Peace(1625), were the first significant codifications ofinternational law. Their philosophical originality lay, however, in the fact that, in defending the rights of a small, militarily weak nation against the powerful states of England, France, and Spain, Grotius was led to a preliminary investigation of the sources and validity of the concept ofnatural law—the notion thatinherentin human reason and immutable even against the willfulness of sovereign states areimperativeconsiderations of natural justice and moral responsibility, which must serve as a check against the arbitrary exercise of vast political power.\nIn general, the political philosophy of the Renaissance and the early modern period was dualistic: it was haunted, even confused, by the conflict between political necessity and general moral responsibility. Machiavelli, Bodin, and Hobbes asserted claims that justified the actions of Italian despotism and theabsolutismof theBourbonandStuartdynasties. Yet Machiavelli was obsessed with the problem of human virtue, Bodin insisted that even the sovereign ought to obey thelaw of nature(that is, to govern in accordance with the dictates of natural justice), and Hobbes himself found in natural law the rational motivation that causes a person to seek security and peace. In the end, Renaissance and early modern political philosophy advocated the doctrines ofThrasymachus, who held that right is what is in the interests of the strong, but it could never finally escape a twinge of Socraticconscience.",
      "imagesId": [
        "2092f778-b452-4ad3-8128-729eed4ff63e"
      ],
      "createdAt": "2025-04-26T21:51:41.409Z",
      "updatedAt": "2025-04-26T21:51:41.409Z",
      "images": [
        {
          "imageId": "2092f778-b452-4ad3-8128-729eed4ff63e",
          "contentId": "1557eb2f-c31d-4948-8b89-1de866a1e002",
          "src": "https://cdn.britannica.com/27/94127-050-836E9D81/Niccolo-Machiavelli-oil-canvas-Santi-di-Tito.jpg?w=300",
          "alt": "Niccolò Machiavelli",
          "caption": "Niccolò MachiavelliNiccolò Machiavelli, oil painting by Santi di Tito; in the Palazzo Vecchio, Florence.(more)",
          "width": 1256,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:41.409Z",
          "updatedAt": "2025-04-26T21:51:41.409Z"
        }
      ]
    },
    {
      "contentId": "e1c3aa14-24c4-46de-8a4e-1cd006f930c2",
      "contentName": "Medieval philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": null,
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:40.820Z",
      "updatedAt": "2025-04-26T21:51:40.820Z",
      "images": []
    },
    {
      "contentId": "3dc4b937-45b6-470b-8d3b-667dd5d766a4",
      "contentName": "The late Middle Ages",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "e1c3aa14-24c4-46de-8a4e-1cd006f930c2",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:38.714Z",
      "updatedAt": "2025-04-26T21:51:38.714Z",
      "images": []
    },
    {
      "contentId": "48e6d575-2bf7-4e1d-ae41-8b90cbdb6878",
      "contentName": "Nicholas of Cusa",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "3dc4b937-45b6-470b-8d3b-667dd5d766a4",
      "content": "Nicholas of Cusa(1401–64) also preferred the Neoplatonists to the Aristotelians. To him the philosophy of Aristotle is an obstacle to the mind in itsascentto God because its primary rule is the principle of contradiction, which denies the compatibility of contradictories. But God is the “coincidence of opposites.” Because he is infinite, he embraces all things in perfect unity; he is at once the maximum and the minimum. Nicholas uses mathematical symbols to illustrate how, in infinity, contradictories coincide. If a circle is enlarged, the curve of its circumference becomes less; if a circle is infinite, its circumference is a straight line. As for human knowledge of the infinite God, one must be content with conjecture or approximation to the truth. The absolute truth escapes human beings; their proper attitude is “learned ignorance.”\nFor Nicholas, God alone is absolutely infinite. The universe reflects this divine perfection and is relatively infinite. It has no circumference, for it is limited by nothing outside of itself. Neither has it a centre; the Earth is neither at the centre of the universe nor is it completely at rest. Place and motion are not absolute but relative to the observer. This new, non-Aristotelianconceptionof the universe anticipated some of the features of modern theories.\nThus, at the end of the Middle Ages, some of the most creative minds were abandoningAristotelianismand turning to newer ways of thought. The philosophy of Aristotle, in its various interpretations, continued to be taught in the universities, but it had lost its vitality and creativity. Christian philosophers were once again finding inspiration inNeoplatonism. ThePlatonismof the Renaissance was directly continuous with the Platonism of the Middle Ages.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:36.612Z",
      "updatedAt": "2025-04-26T21:51:36.612Z",
      "images": []
    },
    {
      "contentId": "6f2917bf-5f79-4d5c-9383-8696f2bc0d47",
      "contentName": "Meister Eckehart",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "3dc4b937-45b6-470b-8d3b-667dd5d766a4",
      "content": "The trend away from Aristotelianism was accentuated by the German DominicanMeister Eckehart(c. 1260–c. 1327), who developed a speculativemysticismof both Christian and Neoplatonic inspiration. Eckehart depicted the ascent of the soul to God in Neoplatonic terms: by gradually purifying itself from the body, the soultranscendsbeing and knowledge until it is absorbed in the One. The soul is then united with God at its highest point, or “citadel.” God himself transcends being and knowledge. Sometimes Eckehart describes God as the being of all things. This language, which was also used by Erigena and other Christian Neoplatonists, leaves him open to the charge ofpantheism(the doctrine that the being of creatures is identical with that of God); but for Eckehart there is an infinite gulf between creatures and God. Eckehart meant that creatures have no existence of their own but are given existence by God, as the body is made to exist and is contained by the soul. Eckehart’s profound influence can be seen in the flowering of mysticism in the German Rhineland in the late Middle Ages.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:36.345Z",
      "updatedAt": "2025-04-26T21:51:36.345Z",
      "images": []
    },
    {
      "contentId": "db3e966d-3789-4c0a-ae5f-acfe91e399ff",
      "contentName": "William of Ockham",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "3dc4b937-45b6-470b-8d3b-667dd5d766a4",
      "content": "In the late 14th century, Thomism and Scotism were called the “old way” (via antiqua) of philosophizing, in contrast to the “modern way” (via moderna) begun by philosophers such as William of Ockham. Ockham, no less than Duns Scotus, wanted to defend the Christian doctrine of the freedom and omnipotence of God and the contingency of creatures against the necessitarianism of Greco-Arabic philosophy. But for him the freedom of God is incompatible with theexistenceof divine ideas as positive models of creation. God does not use preconceived ideas when he creates, as Duns Scotus maintained, but he fashions the universe as he wishes. As a result, creatures have no natures, or essences, in common. There are no realities but individual things, and these have nothing in common. They are more or less like each other, however, and on this basis human beings can form universal concepts of them and talk about them in general terms.\nThe absolute freedom of God was often used by Ockham as a principle of philosophical and theologicalexplanation. Because the order of nature has been freely created by God, it could have been different: fire, for example, could cool as it now heats. If God wishes, he can give us the sight, or “intuitive knowledge,” of a star without the reality of the star. Themoralorder could also have been different. God could have made hating him meritorious instead of loving him. It was typical of Ockham not to put too much trust in the power of human reason to reach thetruth. For him, philosophy must often be content with probable arguments, as in establishing the existence of the Christian God. Faith alone gives certitude in this and in other vital matters. Another principleinvokedby Ockham is that a plurality is not to be posited without necessity. This principle of economy of thought, later stated as “beings are not to be multiplied without necessity,” is called “Ockham’s razor.”\nOckhamism wascensuredby a papal commission at Avignon in 1326, and in 1474 it was forbidden to be taught at Paris. Nevertheless, it spread widely in the late Middle Ages and rivaled Thomism and Scotism in popularity. Other Scholastics in the 14th century shared Ockham’s basic principles and contributed with him toskepticismand probabilism in philosophy.John of Mirecourt(flourished 14th century) stressed the absolute power of God and the divine will to the point of making God the cause of humansin.Nicholas of Autrecourt(c. 1300–c. 1350) adopted a skeptical attitude regarding matters such as the ability of human beings to prove the existence of God and the reality ofsubstanceandcausality. Rejecting Aristotelianism asinimicalto the Christian faith, he advocated a return to theatomismof the ancient Greeks as a more adequate explanation of the universe.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:35.737Z",
      "updatedAt": "2025-04-26T21:51:35.737Z",
      "images": []
    },
    {
      "contentId": "9917890d-7710-418e-8ca6-3f611bdf7792",
      "contentName": "John Duns Scotus",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "3dc4b937-45b6-470b-8d3b-667dd5d766a4",
      "content": "John Duns Scotus opposed the rationalists’contentionthat philosophy is self-sufficient and adequate to satisfy the human desire for knowledge. In fact, he claimed that a pure philosopher, such asAristotle, could not truly understand the human condition because he was ignorant of theFall of Manand his need for grace and redemption. Unenlightened by Christian revelation, Aristotle mistook humankind’s present fallen state, in which all knowledge comes through the senses, for its natural condition, in which the object of knowledge would be coextensive with all being, including the being of God. The limitation of Aristotle’s philosophy was apparent to Duns Scotus in the Aristotelian proof of theexistence of Godas the primary mover of the universe. More adequate than this physical proof, he contended, is his own very intricatemetaphysicaldemonstration of the existence of God as the absolutely primary, unique, andinfinitebeing. He incorporated the Anselmian argument into this demonstration. For Duns Scotus, the notion of infinite being, not that of primary mover or being itself, is humankind’s most perfect concept of God.\nIn opposition to the Greco-Arabic view of the government of the universe from above by necessary causes, Duns Scotus stressed thecontingencyof the universe and its total dependence on God’s infinite creative will. He adopted the traditional Franciscanvoluntarism, elevating the will above the intellect in human beings.\nDuns Scotus’s doctrine of universals justly earned him the title “Doctor Subtilis.” Universals, in his view, exist only as abstract concepts, but they are based on common natures, such as humanity, which exist, or can exist, in many individuals. Common natures are real, and they have a real unity of their own distinct from the unity of the individuals in which they exist. The individuality of each individual is due to an added positive reality that makes the common nature a specific individual—e.g., Socrates. Duns Scotus calls such a reality an “individual difference,” or “thisness” (haecceitas). It is an original development of the earliermedievalrealismofuniversals.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:35.145Z",
      "updatedAt": "2025-04-26T21:51:35.145Z",
      "images": []
    },
    {
      "contentId": "d5907eb2-6e99-4df8-84db-14107dd66d86",
      "contentName": "The age of the Schoolmen",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "e1c3aa14-24c4-46de-8a4e-1cd006f930c2",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:34.670Z",
      "updatedAt": "2025-04-26T21:51:34.670Z",
      "images": []
    },
    {
      "contentId": "dc092607-7332-4d60-a1df-04958608ccb6",
      "contentName": "Averroists",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d5907eb2-6e99-4df8-84db-14107dd66d86",
      "content": "A group of masters in the faculty of arts at Paris welcomed Aristotle’s philosophy and taught it in disregard of its possible opposition to the Christian faith. They wanted to be philosophers, not theologians, and to them this meant following the Aristotelian system. BecauseAverroëswas the recognized commentator on Aristotle, they generally interpreted Aristotle’s thought in an Averroistic way. Hence, in their own day they were known as “Averroists”; today they are often called “Latin Averroists” because they taught in Latin. Their leader,Siger de Brabant(c. 1240–c. 1281), taught as rationally demonstrated certain Aristotelian doctrines that contradicted the faith, such as the eternity of the world and the oneness of the intellect. The Latin Averroists were accused of holding a “double truth”—i.e., of maintaining the existence of two contradictory truths, one commanded by faith, the other taught by reason. Although Siger never proposed philosophical conclusions contrary to faith, other members of this group upheld the right and duty of the philosopher to follow human reason to its natural conclusions, even when they contradicted the truths of faith.\nThis growingrationalismconfirmed the belief of theologians of a traditionalist cast that the pagan and Islamic philosophies would destroy the Christian faith. They attacked these philosophies intreatisessuch asErrores philosophorum(1270;The Errors of the Philosophers) byGiles of Rome(c. 1243–1316). In 1277 the bishop of Paris condemned 219 propositions based on the new trend toward rationalism andnaturalism. These included even some of Aquinas’s Aristotelian doctrines. In the same year, thearchbishop of Canterburymade a similar condemnation at Oxford. These reactions to the novel trends in philosophy did not prevent the Averroists from treating philosophical questions apart from religious considerations. Theologians, for their part, were increasinglysuspiciousof the philosophers and less optimistic about the ultimate reconciliation of philosophy and theology.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:32.548Z",
      "updatedAt": "2025-04-26T21:51:32.548Z",
      "images": []
    },
    {
      "contentId": "36aa05df-771a-4865-b9da-7e33a41d295d",
      "contentName": "Thomas Aquinas",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d5907eb2-6e99-4df8-84db-14107dd66d86",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:31.954Z",
      "updatedAt": "2025-04-26T21:51:31.954Z",
      "images": []
    },
    {
      "contentId": "c80c8039-4789-4ee7-8925-7904d50e6f24",
      "contentName": "Albertus Magnus",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d5907eb2-6e99-4df8-84db-14107dd66d86",
      "content": "The achievement of the Dominican friar Albertus Magnus was of vital importance for the development ofmedieval philosophy. A person of immense erudition and intellectual curiosity, he was one of the first to recognize the truevalueof the newly translated Greco-Arabic scientific and philosophical literature. Everything he considered valuable in it he included in his encyclopaedic writings. He set out to teach this literature to his contemporaries and in particular to make the philosophy of Aristotle, whom he considered to be the greatest philosopher, understandable to them. He also proposed to write original works in order to complete what was lacking in the Aristotelian system. In no small measure, the triumph ofAristotelianismin the 13th century can be attributed to him.\nAlbertus’s observations and discoveries in the natural sciences advanced botany, zoology, and mineralogy. In philosophy he was less original andcreativethan his famous pupil Aquinas. Albertus produced asynthesisof Aristotelianism andNeoplatonism, blending together the philosophies of Aristotle, Avicenna, andIbn Gabiroland, among Christians, Augustine and Pseudo-Dionysius.",
      "imagesId": [
        "ed0339c3-6550-4dc7-8fab-fe38e13d0c8d"
      ],
      "createdAt": "2025-04-26T21:51:31.358Z",
      "updatedAt": "2025-04-26T21:51:31.358Z",
      "images": [
        {
          "imageId": "ed0339c3-6550-4dc7-8fab-fe38e13d0c8d",
          "contentId": "c80c8039-4789-4ee7-8925-7904d50e6f24",
          "src": "https://cdn.britannica.com/79/13579-004-0F7539BE/St-Albertus-Magnus-detail-fresco-Tommaso-da.jpg?w=300",
          "alt": "St. Albertus Magnus",
          "caption": "St. Albertus MagnusSt. Albertus Magnus, detail of a fresco by Tommaso da Modena, c. 1352; in the Church of San Nicolò, Treviso, Italy.(more)",
          "width": 268,
          "height": 300,
          "createdAt": "2025-04-26T21:51:31.358Z",
          "updatedAt": "2025-04-26T21:51:31.358Z"
        }
      ]
    },
    {
      "contentId": "ad5f9dfd-9168-4dd3-929f-9b1635d54c32",
      "contentName": "Bonaventure",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d5907eb2-6e99-4df8-84db-14107dd66d86",
      "content": "The Franciscan friarSt. Bonaventure(c. 1217–74) reacted similarly to the growing popularity of Aristotle and his Arabic commentators. He admired Aristotle as a natural scientist, but he preferredPlatoand Plotinus, and above all Augustine, as metaphysicians. His maincriticismof Aristotle and his followers was that they denied the existence of divine ideas. As a result, Aristotle was ignorant ofexemplarism (God’s creation of the world according to ideas in his mind) and also of divine providence and government of the world. This involved Aristotle in a threefold blindness: he taught that the world is eternal, that all men share one agent intellect (the active principle of understanding), and that there are no rewards or punishments after death. Plato and Plotinus avoided these mistakes, but because they lacked Christian faith, they could not see the wholetruth. For Bonaventure, faith alone enables one toavoiderror in these important matters.\nBonaventure did not confusephilosophywiththeology. Philosophy is knowledge of the things of nature and the soul that is innate in human beings or acquired through their own efforts, whereas theology is knowledge of heavenly things that is based on faith and divinerevelation. Bonaventure, however, rejected the practical separation of philosophy from theology. Philosophy needs the guidance of faith; far from being self-sufficient, it is but a stage in a progression toward the higher knowledge that culminates in the vision of God.\nFor Bonaventure, every creature to some degree bears the mark of its Creator. The soul has been made in the very image of God. Thus, the universe is like a book in which the triune God is revealed. HisItinerarium mentis in Deum(1259;The Soul’s Journey into God) follows Augustine’s path to God, from the external world to the interior world of the mind and then beyond the mind from the temporal to the eternal. Throughout this journey, human beings are aided by amoralandintellectualdivine illumination. The mind has been created with aninnate ideaof God so that, as Anselm pointed out, humans cannot think that God does not exist. In a terse reformulation of the Anselmian argument for God’s existence, Bonaventure states that if God is God, he exists.",
      "imagesId": [
        "a5b20881-6ecc-44de-9544-6c4e8a04744b"
      ],
      "createdAt": "2025-04-26T21:51:30.758Z",
      "updatedAt": "2025-04-26T21:51:30.758Z",
      "images": [
        {
          "imageId": "a5b20881-6ecc-44de-9544-6c4e8a04744b",
          "contentId": "ad5f9dfd-9168-4dd3-929f-9b1635d54c32",
          "src": "https://cdn.britannica.com/54/30554-004-7825D23D/St-Bonaventure-detail-fresco-church-Benozzo-Gozzoli.jpg?w=300",
          "alt": "St. Bonaventure",
          "caption": "St. BonaventureSt. Bonaventure, detail of a fresco by Benozzo Gozzoli; in the church of San Francesco, Montefalco, Italy.(more)",
          "width": 453,
          "height": 450,
          "createdAt": "2025-04-26T21:51:30.758Z",
          "updatedAt": "2025-04-26T21:51:30.758Z"
        }
      ]
    },
    {
      "contentId": "c4c9402e-5fce-4abe-b933-33acf46b6336",
      "contentName": "William of Auvergne",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d5907eb2-6e99-4df8-84db-14107dd66d86",
      "content": "At theUniversity of Paris,William of Auvergne(c. 1180–1249) was one of the first to feel the impact of the philosophies of Aristotle and Avicenna. As a teacher and then as bishop of Paris, he was concerned with the threat to the Christian faith posed by pagan and Islamic thought. He opposed the Aristotelian doctrine of the eternity of the world as contrary to the Christian notion of creation. Hiscritiqueof Avicenna emphasized the latter’sconceptionof God and creation. Against the God of Avicenna, who creates the universe eternally and necessarily through the mediation of 10 intelligences, William defended the Christian notion of a God who creates the world freely and directly. Creatures are radicallycontingentand dependent on God’s creative will. Unlike God, they do not exist necessarily; indeed, theirexistenceis distinct from theiressenceand accidental to it. God has no essence distinct from his existence; he is pure existence. In stressing the essential instability and temporality of the world, William attributed true existence andcausalityto God alone. Although a follower of Augustine, William, like others of his time, was compelled to rethink the older Augustinian notions in terms of the newer Aristotelian and Avicennian philosophies.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:30.493Z",
      "updatedAt": "2025-04-26T21:51:30.493Z",
      "images": []
    },
    {
      "contentId": "06f5ded1-e476-4eb6-8c26-64200df510c7",
      "contentName": "Robert Grosseteste and Roger Bacon",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "d5907eb2-6e99-4df8-84db-14107dd66d86",
      "content": "The newly translated Greek and Arabictreatiseshad an immediate effect on theUniversity of Oxford. Its first chancellor,Robert Grosseteste(c. 1175–1253), commented on some ofAristotle’sworks and translated theNicomachean Ethicsfrom Greek to Latin. He was deeply interested inscientific method, which he described as both inductive and deductive. By the observation of individual events in nature, human beings advance to a general law, called a “universal experimental principle,” which accounts for these events.Experimentationeither verifies or falsifies a theory by testing itsempiricalconsequences. For Grosseteste, the study of nature is impossible without mathematics. Hecultivatedthescienceofoptics(perspectiva), which measures the behaviour of light by mathematical means. His studies of the rainbow and comets employ both observation and mathematics. HistreatiseDe luce(1215–20;On Light) presents light as the basic form of all things and God as the primal, uncreated light.\nGrosseteste’s pupilRoger Bacon(c. 1220–92) made the mathematical and experimental methods the key to natural science. The termexperimental sciencewas popularized in the West through his writings. For him, human beings acquire knowledge through reasoning and experience, but without the latter there can be no certitude. Humans gain experience through the senses and also through an interior divine illumination thatculminatesin mystical experience. Bacon was critical of the methods of Parisian theologians such asSt. Albertus Magnus(c. 1200–80) and Aquinas. He strove to create a universal wisdom embracing all the sciences and organized by theology. He also proposed the formation of a single worldwide society, or “Christian republic,” that would unite all humankind under the leadership of the pope.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:30.234Z",
      "updatedAt": "2025-04-26T21:51:30.234Z",
      "images": []
    },
    {
      "contentId": "bf5c0313-8b52-466d-9ae9-1f300f978e6a",
      "contentName": "The transition to Scholasticism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "e1c3aa14-24c4-46de-8a4e-1cd006f930c2",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:29.956Z",
      "updatedAt": "2025-04-26T21:51:29.956Z",
      "images": []
    },
    {
      "contentId": "401c1a7e-4367-4ec1-8c60-2b0e5414cd73",
      "contentName": "Jewish thought",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "bf5c0313-8b52-466d-9ae9-1f300f978e6a",
      "content": "Of considerably less influence on the Scholastics was medieval Jewish thought.Ibn Gabirol(c. 1022–c. 1058), known to the Scholastics as Avicebron or Avencebrol, was thought to be an Arab or Christian, though in fact he was a Spanish Jew. His chief philosophical work, written in Arabic and preserved in toto only in a Latin translation titledFons vitae(c. 1050;The Fountain of Life), stresses the unity and simplicity of God. All creatures are composed of form and matter, either the gross corporeal matter of the sensible world or the spiritual matter of angels and human souls. Some of the Schoolmen were attracted to the notion of spiritual matter and also to Ibn Gabirol’s analysis of a plurality of forms in creatures, according to which every corporeal being receives a variety of forms by which it is given its place in thehierarchyof being—for example, a dog has the forms of a corporeal thing, a living thing, an animal, and a dog.\nMoses Maimonides(1135–1204), or Moses ben Maimon, was known to Christians of the Middle Ages as Rabbi Moses. HisDalālat al-hāʾirīn(c. 1190;The Guide for the Perplexed) helped them toreconcileGreek philosophywith revealed religion. For Maimonides there could be no conflict between reason and faith because both come from God; an apparent contradiction is due to a misinterpretation of either the Bible or the philosophers. Thus, he showed that creation is reconcilable with philosophical principles and that the Aristotelian arguments for an eternal world are not conclusive because they ignore the omnipotence of God, who can create a world of either finite orinfiniteduration.\nWhile Western scholars wereassimilatingthe new treasures of Greek, Islamic, and Jewish thought, universities that became the centres ofScholasticismwere being founded. Of these, the most important were located inParisandOxford(formed 1150–70 and 1168, respectively). Scholasticism is the name given to the theological and philosophical teachings of the Schoolmen in the universities. There was no single Scholastic doctrine; each of the Scholastics developed his own, which was often in disagreement with that of his fellow teachers. They had in common a respect for the great writers of old, such as the Fathers of the Church, Aristotle,Plato, Boethius, Pseudo-Dionysius, and Avicenna. These they called “authorities.” Their interpretation and evaluation of the authorities, however, frequently differed. They also shared a common style and method that developed out of the teaching practices in the universities. Teaching was done bylectureanddisputation (a formal debate). A lecture consisted of the reading of a prescribed text followed by the teacher’s commentary on it. Masters also held disputations in which theaffirmativeand negative sides of a question were thoroughly argued by students and teacher before the latter resolved the problem.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:27.847Z",
      "updatedAt": "2025-04-26T21:51:27.847Z",
      "images": []
    },
    {
      "contentId": "cdaf7f95-d6e6-436a-8d74-f3a5058e5d91",
      "contentName": "Arabic thought",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "bf5c0313-8b52-466d-9ae9-1f300f978e6a",
      "content": "Among the works to be translated from Arabic were some of the writings ofAvicenna(980–1037). This Islamic philosopher had an extraordinary impact on themedievalSchoolmen. His interpretation of Aristotle’s notion ofmetaphysicsas the science ofens qua ens(Latin: “being as being”), his analysis of manymetaphysicalterms, such asbeing,essence, andexistence, and his metaphysical proof of theexistence of Godwere often quoted, with approval or disapproval, in Christian circles. Also influential were hispsychology, logic, and natural philosophy. HisAl-Qānūn fī al-ṭibb(Canon of Medicine) wasauthoritativeon the subject until modern times. TheMaqāṣid al-falāsifah(1094; “The Aims of the Philosophers”) of the Arabic theologianal-Ghazālī(1058–1111; known in Latin as Algazel), an exposition of Avicenna’s philosophy written in order to criticize it, was read as a complement to Avicenna’s works. The anonymousLiber de causis(“Book of Causes”) was also translated into Latin from Arabic. This work, excerpted from Proclus’sStiocheiōsis theologikē(Elements of Theology), was often ascribed to Aristotle, and it gave a Neoplatonic cast to his philosophy until its true origin was discovered bySt. Thomas Aquinas(c. 1224–74).\nThe commentaries of the Arabic philosopherAverroës(1126–98) were translated along with Aristotle’s works. As Aristotle was called “the Philosopher” by the medieval philosophers, Averroës was dubbed “the Commentator.” The Christian Schoolmen often attacked Averroës as the archenemy of Christianity for hisrationalismand his doctrine of the eternity of the world and the unity of the intellect for all human beings—i.e., the doctrine that intellect is a single, undifferentiated form with which individuals become reunited at death. This wasanathemato the Christian Schoolmen because it contravened the Christian doctrine of individual immortality.",
      "imagesId": [
        "8ec9f211-140b-4002-aefa-787e2ef9738b"
      ],
      "createdAt": "2025-04-26T21:51:27.266Z",
      "updatedAt": "2025-04-26T21:51:27.266Z",
      "images": [
        {
          "imageId": "8ec9f211-140b-4002-aefa-787e2ef9738b",
          "contentId": "cdaf7f95-d6e6-436a-8d74-f3a5058e5d91",
          "src": "https://cdn.britannica.com/23/18323-050-52AA616C/Avicenna-uroscopy-illustration-Liber-chronicarum-Hartmann-Schedel-1493.jpg?w=300",
          "alt": "Avicenna",
          "caption": "AvicennaAvicenna illustration, 1493.(more)",
          "width": 1369,
          "height": 1600,
          "createdAt": "2025-04-26T21:51:27.267Z",
          "updatedAt": "2025-04-26T21:51:27.267Z"
        }
      ]
    },
    {
      "contentId": "7b9b7be2-474e-4a03-87cd-0742b44a656f",
      "contentName": "The early Middle Ages",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "e1c3aa14-24c4-46de-8a4e-1cd006f930c2",
      "content": "",
      "imagesId": [
        "788428c3-3228-47e4-924d-aceca9dd6c86"
      ],
      "createdAt": "2025-04-26T21:51:26.997Z",
      "updatedAt": "2025-04-26T21:51:26.997Z",
      "images": [
        {
          "imageId": "788428c3-3228-47e4-924d-aceca9dd6c86",
          "contentId": "7b9b7be2-474e-4a03-87cd-0742b44a656f",
          "src": "https://cdn.britannica.com/91/30591-004-8253DB41/detail-Boethius-miniature-manuscript-Cambridge-University-Library.jpg?w=300",
          "alt": "Boethius",
          "caption": "BoethiusBoethius, detail of a miniature from a Boethius manuscript, 12th century; in the Cambridge University Library, England (MS li.3.12(D)).(more)",
          "width": 332,
          "height": 450,
          "createdAt": "2025-04-26T21:51:26.997Z",
          "updatedAt": "2025-04-26T21:51:26.997Z"
        }
      ]
    },
    {
      "contentId": "299078d6-ba46-465d-962c-7f29fbf2da9f",
      "contentName": "Bernard de Clairvaux and Abelard",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "7b9b7be2-474e-4a03-87cd-0742b44a656f",
      "content": "Anselm’s inquiry into the existence and nature of God, as also his discussion of truth, love, and human liberty, aimed at fostering monastic contemplation. Other monks, such as the CistercianSt. Bernard de Clairvaux(1090–1153), were suspicious of the use of secular learning and philosophy in matters of faith. Bernard complained of the excessiveindulgencein dialectic displayed by contemporaries such asPeter Abelard(1079–1142). He himself developed a doctrine of mystical love, the influence of which lasted for centuries. The monks of the Parisian abbey of Saint-Victor were no less intent on fostering mystical contemplation, but theycultivatedtheliberal artsand philosophy as an aid to it. In this spirit,Hugh of Saint-Victor(1096–1141) wrote hisDidascalicon(c. 1127; “Teaching”; Eng. trans.,Didascalicon), a monumentaltreatiseon the theoretical and practical sciences and on the trivium (grammar,rhetoric, dialectic) and the quadrivium (arithmetic, music, geometry, astronomy). During the same period theSchool of Chartres, attached to the famousChartres Cathedralnear Paris, was the focus of ChristianNeoplatonismandhumanism.\nUrban development in the 12th century shifted the centre of learning and education from the monasteries to the towns. Abelard founded and taught in several urban schools near Paris. A passionate logician, he pioneered a method intheologythat contributed to the later Scholastic method. HisSic et non(1115–17;Yes and No)citesthe best authorities on both sides of theological questions in order to reach their correct solution. In philosophy his main interest waslogic. On the question of universals, he agreed with neither thenominalistsnor therealistsof his day (seenominalismandrealism). His nominalist teacherRoscelin(c. 1050–c. 1125) held that universals, such as “man” and “animal,” are nothing but words, or names (flatus vocis). Abelard argued that this does not take into account the fact that names have meaning. His realist teacherWilliam of Champeaux(c. 1070–1121) taught that universals are realities apart from the mind. For Abelard, only individuals are real; universals are indeed names or mental concepts, but they have meaning because they refer to individuals. They do not signify an essence common to individuals, as the realists maintained (e.g., the essence “humanity” shared by all human beings), but signify instead the individuals in their common condition, or status, of being in a certain species, which results from God having created them according to the same divineidea.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:25.234Z",
      "updatedAt": "2025-04-26T21:51:25.234Z",
      "images": []
    },
    {
      "contentId": "0b441698-ef16-49f7-bd2e-590ea12f6118",
      "contentName": "Anselm",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "7b9b7be2-474e-4a03-87cd-0742b44a656f",
      "content": "Although the Carolingian empire collapsed in the 10th century andintellectualspeculation was at a low ebb in western Europe, signs of revival appeared almost contemporaneously. Political stability was achieved byOtto I, who reestablished the empire in 963, and Benedictine monasteries were revitalized by reform movements begun at Cluny and Gorze. In the next century, reformers such asPeter Damiancombined theasceticand monastic traditions and laid the foundation for thevita apostolica. LikeTertullian, a Christian writer of the 2nd and 3rd centuries, Damian mistrustedsecularlearning andphilosophyas harmful to the faith. Other monks showed a keen interest indialecticand philosophy. Among the latter was Anselm, an Italian who became abbot of the French monastery of Bec and laterarchbishop of Canterbury.\nLike Augustine, Anselm used both faith and reason in his search fortruth. Faith comes first, in his view, but reason should follow, giving reasons for what human beings believe. Anselm’s monks asked him to write a model meditation on God in which everything would be proved by reason and nothing on the authority of Scripture. He replied with hisMonologion(1077; “Monologue”). It contains three proofs of theexistenceofGod, all of which are based on Neoplatonic thought. The first proof moves from the awareness of amultiplicityof good things to the recognition that they all share or participate more or less in one and the same Good, which is supremely good in itself, and this is God. The second and third proofs are similar, moving from an awareness of a multiplicity of beings that are more or less perfect to the recognition of that through which everything exists, which itself is supremely perfect.\nAnselm’s later work, theProslogion(1077/78; “Allocution” or “Address”), contains his most famous proof of theexistence of God. This begins with a datum of faith: humans believe God to be the being than which none greater can be conceived. Some, like the fool in the Psalms, say there is no God; but even the fool, on hearing these words, understands them, and what he understands exists in his intellect, even though he does not grant that such a being exists in reality. But it is greater to exist in reality and in the understanding than to exist in the understanding alone. Therefore it is contradictory to hold that God exists only in the intellect, for then the being than which none greater can be conceived is one than which a greater can be conceived—namely, one that exists both in reality and in the understanding. Philosophers still debate the meaning and value of this so-calledontological argumentfor God’s existence.",
      "imagesId": [
        "711a544e-189a-41b6-924f-361a73b55120"
      ],
      "createdAt": "2025-04-26T21:51:24.624Z",
      "updatedAt": "2025-04-26T21:51:24.624Z",
      "images": [
        {
          "imageId": "711a544e-189a-41b6-924f-361a73b55120",
          "contentId": "0b441698-ef16-49f7-bd2e-590ea12f6118",
          "src": "https://cdn.britannica.com/31/13431-004-ACAB49DA/St-Anselm-terra-cotta-altarpiece-Luca-Della-Robbia.jpg?w=300",
          "alt": "St. Anselm of Canterbury",
          "caption": "St. Anselm of CanterburySt. Anselm of Canterbury (centre), terra-cotta altarpiece by Luca della Robbia; in the Museo Diocesano, Empoli, Italy.(more)",
          "width": 447,
          "height": 450,
          "createdAt": "2025-04-26T21:51:24.624Z",
          "updatedAt": "2025-04-26T21:51:24.624Z"
        }
      ]
    },
    {
      "contentId": "55cb7ebc-822e-4b60-8bc2-037ee2f71268",
      "contentName": "The Greek Fathers of the Church and Erigena",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "7b9b7be2-474e-4a03-87cd-0742b44a656f",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:23.840Z",
      "updatedAt": "2025-04-26T21:51:23.840Z",
      "images": []
    },
    {
      "contentId": "60770132-d7fc-4a04-b4c9-8467d0bba321",
      "contentName": "Boethius",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "7b9b7be2-474e-4a03-87cd-0742b44a656f",
      "content": "One of the most important channels by which Greek philosophy was transmitted to the Middle Ages was Boethius. He began to translate into Latin all the philosophical works of the Greeks, but his imprisonment and death by order ofTheodoric, king of the Ostrogoths, cut short this project. He finished translating only the logical writings of Porphyry and Aristotle. These translations and his commentaries on them brought to the thinkers of the Middle Ages the rudiments of Aristotelianlogic. They also raised important philosophical questions, such as those concerning the nature ofuniversals(terms that can be applied to more than oneparticularthing). Do universals exist independently, or are they only mentalconcepts? If they exist independently, are they corporeal or incorporeal? If incorporeal, do they exist in the sensible world or apart from it? Medieval philosophers debated at length these and other problems relating to universals. In his logical works Boethius presents the Aristotelian doctrine of universals: that they are only mental abstractions. In hisDe consolatione philosophiae(c. 525;Consolation of Philosophy), however, he adopts thePlatonicnotion that they areinnate ideas, and their origin is in the remembering of knowledge from a previous existence. This book was extremely popular and influential in the Middle Ages. It contains not only a Platonic view of knowledge and reality but also a lively treatment of providence, divine foreknowledge, chance, fate, and human happiness.",
      "imagesId": [
        "1d1af51a-4f95-4020-87ee-c3a7d29f3505"
      ],
      "createdAt": "2025-04-26T21:51:23.592Z",
      "updatedAt": "2025-04-26T21:51:23.592Z",
      "images": [
        {
          "imageId": "1d1af51a-4f95-4020-87ee-c3a7d29f3505",
          "contentId": "60770132-d7fc-4a04-b4c9-8467d0bba321",
          "src": "https://cdn.britannica.com/91/30591-004-8253DB41/detail-Boethius-miniature-manuscript-Cambridge-University-Library.jpg?w=300",
          "alt": "Boethius",
          "caption": "BoethiusBoethius, detail of a miniature from a Boethius manuscript, 12th century; in the Cambridge University Library, England (MS li.3.12(D)).(more)",
          "width": 332,
          "height": 450,
          "createdAt": "2025-04-26T21:51:23.592Z",
          "updatedAt": "2025-04-26T21:51:23.592Z"
        }
      ]
    },
    {
      "contentId": "62eb5874-00b2-4c6f-8f13-ec3531fb7b87",
      "contentName": "Augustine",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "7b9b7be2-474e-4a03-87cd-0742b44a656f",
      "content": "During these centuries philosophy was heavily influenced by Neoplatonism;StoicismandAristotelianismplayed only a minor role. Augustine was awakened to the philosophical life by reading the Roman statesmanCicero(106–43bce), but the Neoplatonists most decisively shaped his philosophical methods and ideas. To them he owed hisconvictionthat beyond the world of the senses there is a spiritual, eternal realm ofTruththat is the object of the human mind and the goal of all human striving. This Truth he identified with the God of Christianity. Human beings encounter this divine world not through the senses but through the mind—and, above the mind, through the intelligible light. Augustine’s demonstration of theexistence of Godcoincides with his proof of theexistenceof necessary, immutable Truth. He considered the truths of both mathematics andethicsto be necessary, immutable, and eternal. These truths cannot come from the world ofcontingent, mutable, and temporal things, nor from the mind itself, which is also contingent, mutable, and temporal. They are due to theilluminatingpresence in the human mind of eternal and immutable Truth, or God. Any doubt that humans may know the Truth with certainty was dispelled for Augustine by the certitude that, even if they are deceived in many cases, they cannot doubt that they exist, know, and love.\nAugustine conceived ofhuman beingsas composites of two substances, body andsoul, of which the soul is by far the superior. The body, nevertheless, is not to be excluded fromhuman nature, and its eventual resurrection from the dead is assured by Christian faith. The soul’simmortalityis proved by its possession of eternal and unchangeable Truth.\nAugustine’sConfessions(c. 400) andDe Trinitate(400–416;On the Trinity) abound with penetrating psychological analyses of knowledge, perception, memory, and love. HisDe civitate Dei(413–426;The City of God) presents the whole drama of human history as a progressive movement of humankind, redeemed by God, to its finalreposein its Creator.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:23.356Z",
      "updatedAt": "2025-04-26T21:51:23.356Z",
      "images": []
    },
    {
      "contentId": "2b6be73e-6494-4826-88ff-9c5bc4838f91",
      "contentName": "Ancient Greek and Roman philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": null,
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:22.745Z",
      "updatedAt": "2025-04-26T21:51:22.745Z",
      "images": []
    },
    {
      "contentId": "1afe8414-c000-4f54-a12f-2d39e4c45c5e",
      "contentName": "Hellenistic and Roman philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "2b6be73e-6494-4826-88ff-9c5bc4838f91",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:20.658Z",
      "updatedAt": "2025-04-26T21:51:20.658Z",
      "images": []
    },
    {
      "contentId": "3dd2f5af-c9f7-4b61-a541-816b2e69da4e",
      "contentName": "Neo-Pythagoreanism and Neoplatonism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1afe8414-c000-4f54-a12f-2d39e4c45c5e",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:18.900Z",
      "updatedAt": "2025-04-26T21:51:18.900Z",
      "images": []
    },
    {
      "contentId": "5afad157-ab4b-46fb-aa9b-7dc55a5f656f",
      "contentName": "Skepticism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1afe8414-c000-4f54-a12f-2d39e4c45c5e",
      "content": "There was still another Hellenistic school of philosophy,Skepticism, which was initiated by another of Zeno’s contemporaries,Pyrrhon of Elis(c. 360–c. 272bce), and was destined to become of great importance for the preservation of detailed knowledge of Hellenistic philosophy in general. Pyrrhon had come to theconvictionthat no one can know anything for certain, nor can he ever be certain that the things he perceives with his senses are real and not illusory. Pyrrhon is said to have carried the practical consequences of his conviction so far that, when walking in the streets, he paid no attention to vehicles and other obstacles, so that his faithfuldisciplesalways had to accompany him to see that he came to no harm. Pyrrhon’s importance for the history of philosophy lies in the fact that one of the later adherents of his doctrine,Sextus Empiricus(flourished 3rd centuryce), wrote a large work,Pros dogmatikous(“Against the Dogmatists”), in which he tried to refute all of the philosophers who held positive views, and in so doing he quoted extensively from their works, thus preserving much that would otherwise have been lost. It is a noteworthy fact that the British empiricists of the 18th century, such asDavid Hume(1711–76), as well asImmanuel Kant(1724–1804),derivedmost of their knowledge of ancient philosophy from Sextus Empiricus.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:18.298Z",
      "updatedAt": "2025-04-26T21:51:18.298Z",
      "images": []
    },
    {
      "contentId": "fb34375b-5983-49fe-a0f6-460886d318f9",
      "contentName": "Epicureanism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1afe8414-c000-4f54-a12f-2d39e4c45c5e",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:17.708Z",
      "updatedAt": "2025-04-26T21:51:17.708Z",
      "images": []
    },
    {
      "contentId": "7a534a22-50a8-4d92-890a-e42e5bb9b647",
      "contentName": "Stoicism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1afe8414-c000-4f54-a12f-2d39e4c45c5e",
      "content": "TheStoicsystem was created byZeno of Citium(c. 335–c. 263bce), who went to Athens as a merchant. He stayed at Athens, heard the lectures of various philosophers, and—after he had elaborated his own philosophy—began to teach in a public hall, the Stoa Poikile (hence the name Stoicism).\nZeno’s thoughtcomprised, essentially, a dogmatized Socraticphilosophy, with added ingredients derived fromHeracleitus(c. 540–c. 480bce). The basis of human happiness, he said, is to live “in agreement” with oneself, a statement that was later replaced by the formula “to live in agreement with nature.” The only real good for ahuman beingis the possession of virtue; everything else—wealth or poverty, health or illness, life or death—is completely indifferent. Allvirtuesare based exclusively on right knowledge, self-control (sōphrosynē) being the knowledge of the right choice,fortitudethe knowledge of what must be endured and what must not, andjusticethe right knowledge “in distribution.” The passions, which are the cause of all evil, are the result of error in judging what is a real good and what is not. Because it is difficult to see, however, why murder, fraud, and theft should be considered evil if life and possessions are of no value, the doctrine was later modified to distinguish between “preferable things,” such as having the necessities of life and health, “completely indifferent things,” and “anti-preferable things,” such as lacking the necessities of life or health—while insisting still that the happiness of the truly wise person could not be impaired by illness, pain, hunger, or any deprivation of external goods. In the beginning, Zeno also insisted that an individual is either completely wise, in which case he would never do anything wrong and would be completely happy, or he is a fool. Later he made theconcession, however, that there are people who are not completely wise but who are progressing toward wisdom. Although these people might even have true insight, they are not certain that they have it, whereas the truly wise person is also certain of having true insight. The world is governed by divinelogos—a word originally meaning “word” or “speech,” then (with Heracleitus) a speech that expresses the laws of the universe, then (finally) “reason.” This logos keeps the world in perfect order. Human beings can deviate from or rebel against this order, but, by doing so, they cannot disturb it but can only do harm to themselves.\nZeno’s philosophy was further developed byCleanthes(c. 331–c. 232bce), the second head of the school, and byChrysippus(c. 280–c. 206bce), its third head. Chrysippus elaborated a new kind oflogic, which did not receive much attention outside the Stoic school until recent times; this “propositional logic” has been hailed by some logicians as superior to the “conceptual logic” of Aristotle.Panaetiusof Rhodes (c. 180–109bce) adapted Stoic philosophy to the needs of the Romanaristocracy, whose members then governed the Western world, and made a great impression on some of the leading figures of the time, who tried to follow hismoralprecepts. In the following century, a time of civil war,slave rebellions, and the decay of the Roman Republic,Poseidoniusof Apamea (c. 135–c. 51bce), who was also one of the most brilliant historians of all times, taught that the Stoic takes a position above the rest of humankind, looking down on its struggles as on a spectacle. In the period of the consolidation of the empire, Stoicism became the religion of the republican opposition. The most famous Stoic was the youngerCato(95–46bce), who committed suicide after the victory ofJulius Caesar(c. 100–44bce). It was also the guiding philosophy ofSeneca the Younger(c. 4bce–65ce), the educator and (for a long time) the adviser of the emperorNero(37–68), who tried to keep Nero on the path of virtue but failed and finally was forced to commit suicide on Nero’s orders. Despite the oddities of Zeno’s originaldoctrine, Stoicism gave consolation, composure, and fortitude in times of trouble to many proud individuals to the end of antiquity and beyond.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:17.120Z",
      "updatedAt": "2025-04-26T21:51:17.120Z",
      "images": []
    },
    {
      "contentId": "02dd156a-a5c8-4304-84b6-b4b6f8e4c2a8",
      "contentName": "The seminal thinkers of Greek philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "2b6be73e-6494-4826-88ff-9c5bc4838f91",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:16.875Z",
      "updatedAt": "2025-04-26T21:51:16.875Z",
      "images": []
    },
    {
      "contentId": "1b25ecdc-90db-4ca0-91b6-7e610f2d7363",
      "contentName": "Aristotle",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "02dd156a-a5c8-4304-84b6-b4b6f8e4c2a8",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:14.785Z",
      "updatedAt": "2025-04-26T21:51:14.785Z",
      "images": []
    },
    {
      "contentId": "5a9b7267-7b4b-4832-9139-d1b90fb3e386",
      "contentName": "Disciples and commentators",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1b25ecdc-90db-4ca0-91b6-7e610f2d7363",
      "content": "AfterAristotle’s death his immediatedisciplescarried on the same kind of work, especially in the historical field:Theophrastuswrote a history of philosophy and works on botany and mineralogy,Eudemus of Rhodes(flourished before 300bce) wrote histories of mathematics and astronomy,Menowrote ahistory of medicine, andDicaearchusof Messene (flourished c. 320bce) wrote a history of civilization and a book on types of political constitutions. The next two generations of Peripatetics spread out in two directions: literary history, in the form of histories of poetry, epic, tragedy, and comedy, as well as biographies of famous writers, andphysical science.Straton of Lampsacus(died c. 270bce) created a new kind ofphysicsbased on experiments, and the great astronomerAristarchus of Samos(c. 310–230bce) invented theheliocentric system. The school then went for some time intoeclipseuntil, in the 1st centuryce, after the rediscovery of Aristotle’s lecture manuscripts, there arose a great school of commentators on his works, which had an enormous influence onmedieval philosophy.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:13.036Z",
      "updatedAt": "2025-04-26T21:51:13.036Z",
      "images": []
    },
    {
      "contentId": "060fa0e7-6d3b-478f-9922-2036deb60444",
      "contentName": "Philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "1b25ecdc-90db-4ca0-91b6-7e610f2d7363",
      "content": "Aristotle became a member of the Academy at the age of 17, in the year 367bce, when the school was under the acting chairmanship ofEudoxus of Cnidus(c. 395–c. 342bce), a great mathematician and geographer (Plato was away in Sicily at the time). It is a controversial question as to how far Aristotle, during the 20 years of his membership in the Academy, developed aphilosophyof his own differing from that of his master. But two things can be considered as certain: (1) that he soon raised certain objections to Plato’s theory of Forms, for one of the objections attributed to him is discussed in Plato’sdialogueParmenides, which Plato must have written soon after his return from Sicily, and (2) that it was during his membership in the Academy that Aristotle began and elaborated his theoretical and formal analysis of the arguments used in various Socratic discussions—an enterprise that, when completed, resulted in the corpus of his works onlogic. Aristotle rightly claimed to have invented this discipline; indeed, until rather recent times it was said that he completed it in such a way that hardly anything could be added.\nCertainly quite some time before his return to Athens to open a school of his own, Aristotle declared that it is not necessary to assume theexistenceof a separate realm oftranscendentForms, of which the individual things that human beings perceive with their senses are but imperfect copies; that the world of perceived things is the real world; and that, in order to build up a system of knowledge about certain types or groups of things, it is necessary merely to be able to say that something is generally true of them. Thus, it would be wrong to say that, having abandoned the theory of Forms, Aristotle was left with a completelycontingentworld. The last chapters of hisPosterior Analyticsshow, on the contrary, that he merely replaced Plato’s transcendent Forms with something (katholou) corresponding to them that the human mind can grasp in individual things.\nAristotle retained another important element of the theory of Forms in histeleology, or doctrine of purposiveness. According to Plato, individual things are imperfect copies of perfect Forms. Aristotle pointed out, however, that all living beings develop from an imperfect state (from the seed, the semen, through the germinating plant, or embryo, to the child and young adult) to the more perfect state of the fully developed plant or the full-grown mature animal or human—after which they againdecayand finally die, having reproduced. But not all individuals reach the same degree of relative perfection. Many of them die before reaching it; others are retarded or crippled or maimed in various ways in the process. It is, therefore, of the utmost importance for human beings to find out what the best conditions are for reaching the most perfect state possible. This is what the gardener tries to do for the plants; but it is even more important for humankind to do in regard to itself. The first question, then, is what kind of perfection a human being, as human, can reach. In answering this question, Aristotle observed thathuman beings, as social animals par excellence, can reach as individuals only some of the perfections possible for humans as such. Cats are more or less all alike in their functions; thus each can fend for itself. With bees and termites, however, it is different. They are by nature divided into worker bees, drones, and queen bees, or worker termites, soldier termites, and queens. With human beings the differentiation of functions is much more subtle and varied. People can lead satisfactory lives only on the basis of adivision of labourand distribution of functions. Some individuals are born with very great talents and inclinations for special kinds of activity. They will be happy and will make their best possible contribution to the life of thecommunityonly if they are permitted to follow this inclination. Others are less one-sidedly gifted and more easily adaptable to a variety of functions. These people can be happy shifting from one activity to another. This fact represents an enormous advantage the human species has over all other animals, because it enables it to adapt to all sorts of circumstances. But the advantage is paid for by the fact that no human individual is able to develop all of the perfections that are possible for the species as a whole.\nThere is another possible and, in its consequences, real disadvantage to such adaptability: the other animals, tightlyconfinedto the limits set by nature, are crippled almost exclusively by external factors, but humans, in consequence of thefreedomof choice granted to them through the variety of their gifts, can and very often do cripple and harm themselves. All human activities are directed toward the end of a good and satisfactory life. But there are many subordinate aims that are sensible ends only as far as they serve a superior end. There is, for example, no sense in producing or acquiring more shoes than can possibly be worn. This is self-evident. With regard tomoney, however, which has become exchangeable against everything, theillusionarises that it is good to accumulate it without limit. By doing so, humans harm both the community and themselves because, by concentrating on such a narrow aim, they deprive their souls and spirits of larger and more rewarding experiences. Similarly, an individual especially gifted for large-scale planning needspowerto give orders to those capable of executing his plans. Used for such purposes, power is good. But coveted for its own sake, it becomes oppressive to those subdued by it and harmful to the oppressor because he thus incurs the hatred of the oppressed. Because of their imperfections, humans are not able to engage in serious and fruitful activities without interruption. They need relaxation and play, or amusement. Because the necessities of life frequently force them to work beyond the limit within which working is pleasant, the illusion arises that a life of constant amusement would be the most pleasant and joyful. In reality nothing would be more tedious.\nAristotle’s teleology seems to be based entirely onempiricalobservation. It has nothing to do with a belief in divine providence and is not, as some modern critics believe, at variance with the law ofcausality. It forms the foundation, however, of Aristotle’sethicsand political theory. Aristotle was anavidcollector ofempirical evidence. He induced his students, for instance, to study the laws and political institutions of all known cities and nations in order to find out how they worked and at what points their initiators had been mistaken regarding the way in which they would work. In later times, Aristotle came to be considered (and by many is still considered) adogmaticphilosopher because the results of his inquiries were accepted as absolutelyauthoritative. In reality, however, he was one of the greatest empiricists of all times.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:12.784Z",
      "updatedAt": "2025-04-26T21:51:12.784Z",
      "images": []
    },
    {
      "contentId": "ea565e98-d447-4f99-913f-1493276ca426",
      "contentName": "Plato",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "02dd156a-a5c8-4304-84b6-b4b6f8e4c2a8",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:12.163Z",
      "updatedAt": "2025-04-26T21:51:12.163Z",
      "images": []
    },
    {
      "contentId": "6f1be924-c01c-4c6f-886d-240e4b715f1a",
      "contentName": "Philosophy",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "ea565e98-d447-4f99-913f-1493276ca426",
      "content": "In the field of theoreticalphilosophy, Plato’s most influential contribution was undoubtedly his theory ofForms, which he derived from Socrates’ method in the following way: Socrates, in trying to bring out the inconsistencies in his interlocutors’ opinions and actions, often asked what it is that makes people say that a certain thing or action is good or beautiful orpiousor brave; and he asked what people are looking at when they make such statements. Plato sometimes, in his dialogues, made Socrates ask what is theeidos, or idea—i.e., the image—that a person has before him when he calls something “good.” A definite answer is never given, however, because no abstract definition would be adequate, the purpose being rather to make the interlocutor aware of the fact that he somehow does look at something indefinable when making such statements.\nWhat was at first simply a way of somehow expressing something that is difficult to express developed into a definite theory of Forms when Plato made the discovery that something similar could be observed in the field of mathematics. No two things in the visible world are perfectly equal, just as there is nothing that is perfectly good or perfectly beautiful.Yetequality is one of the most fundamental concepts not only in mathematics but also in everyday life—the foundation of all measurement. Hence, like the notion of the good and the beautiful, it appears to come from a different world, a world beyond the senses, a world that Plato then called the world of Forms. Further intimations of such a realm beyond the immediate realm of the senses may be found in the fact that, in construing a system ofknowledge, people constantly prefer what is more perfect to what is less perfect—i.e., what is formed and thus recognizable to what is not, what is true to what is false, a sound logical conclusion to a logical fallacy, even an elegant scientific demonstration to a clumsy one, without considering the former as good and the latter as bad.\nAccording to Plato, all of the things that people perceive with their senses are but very imperfect copies of the eternal Forms. The most important and fundamental Form is that of theGood. It is “beyond being and knowledge,” yet it is the foundation of both. “Being” in thiscontextdoes not meanexistence, but something specific—a human, a lion, or a house—being recognizable by itsqualityor shape.\nKnowledge begins with a perception of these earthly shapes, but it ascends from there to the higher realm of Forms, which is approachable to the human mind. In the famousmyth of the cavein the seventh book of theRepublic, Plato likened the ordinary person to a man sitting in a cave looking at a wall on which he sees nothing but the shadows of real things behind his back, and he likened the philosopher to a man who has gotten out into the open and seen the real world of the Forms. Coming back, he may be less able to distinguish the shades because he has been blinded by the light outside; but he is the only one who knows reality, and he conducts his life accordingly.\nIn his later dialogues, especially theTheaetetus, Plato criticized an empiricisttheory of knowledge, anticipating the views of 17th-century English philosophers such asThomas Hobbes(1588–1679). In theTimaeus, Plato tried to construct a complete system ofphysics, partly employing Pythagorean ideas.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:10.219Z",
      "updatedAt": "2025-04-26T21:51:10.219Z",
      "images": []
    },
    {
      "contentId": "8a120a4a-c700-40b1-be77-fa598a00110d",
      "contentName": "Life",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "ea565e98-d447-4f99-913f-1493276ca426",
      "content": "As a very young man, Plato became aferventadmirer of Socrates in spite of the latter’s plebeian origins. Contrary to his master, however, who always concerned himself with the attitudes of individuals, Plato believed in the importance of political institutions. In his early youth he had observed that the Athenian masses, listening to the glorious projects of ambitious politicians, had engaged in foolhardy adventures of conquest, which led in the end to total defeat in thePeloponnesian War(431–404bce). When, in consequence of the disaster,democracywas abolished, Plato at first set great hopes in the Thirty Tyrants—especially since their leader, Critias, was a close relative. But he soon discovered that—to use his own words—the despised democracy had been gold in comparison with the new terror. When theoligarchywas overthrown and the restored democracy, in 399bce, adopted a new law code—in fact, a kind of written constitution containing safeguards against rash political decisions—Plato again had considerable hope and was even inclined to view the execution of Socrates as an unfortunate incident rather than a logical consequence of the new regime. It was only some years later, when demagogy appeared to raise its head again, that he “despaired and was forced to say that things would not become better in politics unless the philosophers would become rulers or the rulers philosophers.” He wrote adialogue, theGorgias, violently denouncing political oratory andpropaganda, and then traveled to southern Italy in order to study political conditions there. Again, however, he found the much-vaunted dolce vita of the Greeks there, in which the rich lived in luxury exploiting the poor, much worse than in the democracy at Athens. But atSyracusehe met a young man,Dion(c. 408–354bce)—brother-in-law of the ruling tyrant,Dionysius I(c. 430–367bce)—who listened eagerly to his political ideas and promised to work for their realization if any occasion should arise. On his return to Athens, Plato founded theAcademy, an institution for the education of philosophers, and in the following years he produced, besides otherdialogues, his great work,Republic, in which he drew the outlines of an idealstate. Because it is the passions and desires of human beings that cause all disturbances in society, the state must be ruled by an elite that governs exclusively by reason and is supported by a class of warriors entirely obedient to it. Both ruling classes must have no individual possessions and no families and lead an extremelyausterelife, receiving the necessities of life from the working population, which alone is permitted to own private property. The elite receives a rigid education to fit it for its task. At the death of Dionysius, Dion induced Plato to come to Syracuse again to try to persuade Dionysius’s successor,Dionysius II(flourished 4th centurybce), to renounce his power in favour of a realization of Plato’s ideals. But the attempt failed, and in his later political works, theStatesmanand theLaws, Plato tried to show that only a god could beentrustedwith the absolute powers of the philosopher-rulers of his republic. Human rulers must be controlled by rigid laws, he held—though all laws are inevitably imperfect because life is too varied to be governed adequately by general rules. But theLawsstill placed strict restrictions on the ownership of property.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:09.964Z",
      "updatedAt": "2025-04-26T21:51:09.964Z",
      "images": []
    },
    {
      "contentId": "f592bd62-d3d1-43f4-b6c0-21ede109a5d7",
      "contentName": "Socrates",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "02dd156a-a5c8-4304-84b6-b4b6f8e4c2a8",
      "content": "Socrates (c. 470–399bce) was also widely considered to be aSophist, though he did not teach for money and his aims were entirely different from theirs. Although there is a late tradition according to whichPythagorasinvented the wordphilosopher, it was certainly through Socrates—who insisted that he possessed no wisdom but was striving for it—that the term came into general use and was later applied to all earlier serious thinkers. In fact, all of the records of Socrates’ life and activity left by his numerous adherents anddisciplesindicate that he never tried to teach anything directly. But he constantly engaged in conversations with everybody—old and young, high and low—trying to bring into the open by his questions the inconsistencies in their opinions and actions. His whole way of life rested on two unshakable premises: (1) the principle never to do wrong nor to participate, even indirectly, in any wrongdoing and (2) theconvictionthat nobody who really knows what isgoodandrightcould act against it. He demonstrated hisadherenceto the first principle on various occasions and under different regimes. When, after the Battle of Arginusae (406bce), the majority of the Athenian popular assembly demanded death without trial for the admirals, Socrates, who on that day happened to be president of the assembly (an office changing daily), refused to put the proposal to a vote because he believed it was wrong to condemn anyone without a fair trial. He refused even though the people threatened him, shouting that it would be terrible if thesovereignpeople could not do as they pleased.\nWhen, after the overthrow ofdemocracyinAthensin 404bce, the so-calledThirty Tyrants, who tried to involve everybody in their wrongdoing, ordered him to arrest an innocent citizen whose money they coveted, he simply disobeyed. This he did despite the fact that such disobedience was even more dangerous than disobeying the sovereign people had been at the time of unrestricteddemocracy. Likewise, in the time of the democracy, he pointed out by his questions the inconsistency of allowing oneself to be swayed by the oratory of a good speaker instead of first inquiring into his capability as a statesman, whereas in private life a sensible citizen would not listen to the oratory of a quack but would try to find the best doctor. When, after the overthrow of democracy, the Thirty Tyrants had many people arbitrarily executed, Socrates asked everybody whether a man was a good shepherd whodiminishedthe number of sheep instead of increasing it; and he did not cease his questioning whenCritias, the leader of the Thirty Tyrants, warned him to take heed not to diminish the number of sheep by his own—Socrates’—person. But the most fundamental inconsistency that he tried to demonstrate everywhere was that most people by their actions show that what they consider good, wonderful, and beautiful in others—such as, for instance, doing right at great danger to oneself—they do not consider good for themselves, and what they consider good for themselves they despise and condemn in others. Although these stands won him theferventadmiration of many, especially among the youth, they also caused great resentment among leading politicians, whose inconsistencies and failings were exposed. Although Socrates had survived unharmed through the regime of the Thirty Tyrants—partly because it did not last long and partly because he was supported by some close relatives of their leader, Critias—it was under the restored democracy that he was accused of impiety and of corrupting the youth and finally condemned to death, largely also in consequence of hisintransigentattitude during the trial.\nAfter Socrates’ death his influence became a dominating one through the greater part of the history of Greek and Romanphilosophydown to the end of antiquity, and it has been significant ever since. Many of his adherents—Plato first among them, but also including the historianXenophon(431–c. 350bce)—tried to preserve his philosophical method by writing Socraticdialogues. Some founded schools or sects that perpetuated themselves over long periods of time:Eucleidesof Megara (c. 430–c. 360bce) emphasized the theoretical aspects of Socrates’ thought (seeMegarian school), andAntisthenes(c. 445–c. 365bce) stressed the independence of the true philosopher from material wants. The latter, through hisdiscipleDiogenesof Sinope (died c. 320bce), who carried voluntary poverty to the extreme and emphasized freedom from all conventions, became the founder of the sect of theCynics.Aristippusof Cyrene (c. 435–366bce), traditional founder of theCyrenaicschool, stressed independence from material goods in a somewhat different way, declaring that there is no reason why a philosopher should not enjoy material goods as long as he is completely indifferent to their loss. Although Aristippus renounced his son because he led a dissolute life, the school that he founded (through his daughter and his grandson) was hedonistic, holding pleasure to be the only good.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:09.708Z",
      "updatedAt": "2025-04-26T21:51:09.708Z",
      "images": []
    },
    {
      "contentId": "173ad8a6-566f-4f95-a797-63c5cc25c135",
      "contentName": "The pre-Socratic philosophers",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "2b6be73e-6494-4826-88ff-9c5bc4838f91",
      "content": "",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:09.431Z",
      "updatedAt": "2025-04-26T21:51:09.431Z",
      "images": []
    },
    {
      "contentId": "03c5dd77-02cb-4819-b3a3-6d8fc90bc44d",
      "contentName": "Anthropology and relativism",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "173ad8a6-566f-4f95-a797-63c5cc25c135",
      "content": "In the middle of the 5th centurybce, Greek thinking took a somewhat different turn through the advent of theSophists. The name is derived from the verbsophizesthai, “making a profession of being inventive and clever,” and aptly described the Sophists, who, in contrast to the philosophers mentioned so far, charged fees for their instruction. Philosophically they were, in a way, the leaders of a rebellion against the preceding development, which increasingly had resulted in the belief that the real world is quite different from the phenomenal world. “What is the sense of such speculations?” they asked, since no one lives in these so-called real worlds. This is the meaning of the pronouncement ofProtagorasof Abdera (c. 490–c. 420bce) that “man is the measure of all things, of those which are that they are and of those which are not that they are not.” For human beings the world is what it appears to them to be, not something else; Protagoras illustrated his point by saying that it makes no sense to tell a person that it is really warm when he is shivering with cold because for him it is cold—for him, the cold exists, is there.\nHis younger contemporaryGorgiasof Leontini (flourished 5th centurybce), famous for histreatiseon the art of oratory, made fun of the philosophers in his bookPeri tou mē ontos ē peri physeōs(“On That Which Is Not; or, On Nature”), in which—referring to the “truly existing world,” also called “the nature of things”—he tried to prove (1) that nothing exists, (2) that if something existed, one could have no knowledge of it, and (3) that if nevertheless somebody knew something existed, he could not communicate his knowledge to others.\nThe Sophists were not only skeptical of what had by then become a philosophical tradition but also of other traditions. On the basis of the observation that different nations have different rules of conduct even in regard to things considered most sacred—such as the relations between the sexes, marriage, and burial—they concluded that most rules of conduct areconventions. What is really important is to be successful in life and to gain influence over others. This they promised to teach. Gorgias was proud of the fact that, having no knowledge of medicine, he was more successful in persuading a patient to undergo a necessary operation than his brother, a physician, who knew when an operation was necessary. The older Sophists, however, were far from openly preaching immoralism. They, nevertheless, gradually came under suspicion because of their sly ways of arguing. One of the later Sophists,Thrasymachus of Chalcedon(flourished 5th centurybce), was bold enough to declare openly that “right is what isbeneficialfor the stronger or better one”—that is, for the one able to win the power to bend others to his will.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:07.317Z",
      "updatedAt": "2025-04-26T21:51:07.317Z",
      "images": []
    },
    {
      "contentId": "1f3121ad-d715-408d-8b5f-84f696a8af25",
      "contentName": "Metaphysics of number",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "173ad8a6-566f-4f95-a797-63c5cc25c135",
      "content": "All of the philosophies mentioned so far are in various ways historically akin to one another. Toward the end of the 6th centurybce, however, there arose, quite independently, another kind of philosophy, which only later entered into interrelation with the developments just mentioned: the philosophy ofPythagorasof Samos (c. 580–c. 500bce;see alsoPythagoreanism). Pythagoras traveled extensively in theMiddle Eastand in Egypt and, after his return to Samos, emigrated to southern Italy because of his dislike of thetyrannyofPolycrates(c. 535–522bce). At Croton and Metapontum he founded a philosophical society with strict rules and soon gained considerable political influence. He appears to have brought his doctrine of the transmigration of souls from the Middle East. Much more important for the history of philosophy andscience, however, was his doctrine that “all things are numbers,” which means that the essence and structure of all things can be determined by finding the numerical relations they express. Originally, this, too, was a very broad generalization made on the basis of comparatively few observations: for instance, that the same harmonies can be produced with different instruments—strings, pipes, disks, etc.—by means of the same numerical ratios—1:2, 2:3, 3:4—in one-dimensional extensions; the observation that certain regularities exist in the movements of the celestial bodies; and the discovery that the form of a triangle is determined by the ratio of the lengths of its sides. But because the followers of Pythagoras tried to apply their principle everywhere with the greatest of accuracy, one of them—Hippasus of Metapontum(flourished 5th centurybce)—made one of the most fundamental discoveries in the entire history of science: that the side and diagonal of simple figures such as the square and the regular pentagon are incommensurable (i.e., their quantitative relation cannot be expressed as a ratio of integers). At first sight this discovery seemed to destroy the very basis of the Pythagorean philosophy, and the school thus split into two sects, one of which engaged in ratherabstrusenumerical speculations, while the other succeeded in overcoming the difficulty by ingenious mathematical inventions. Pythagorean philosophy also exerted a great influence on the later development ofPlato’sthought.\nThe speculations described so farconstitute, in many ways, the most important part of the history ofGreek philosophybecause all of the most fundamental problems of Western philosophy turned up here for the first time. One also finds here the formation of a great many concepts that have continued to dominate Western philosophy and science to the present day.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:07.044Z",
      "updatedAt": "2025-04-26T21:51:07.044Z",
      "images": []
    },
    {
      "contentId": "40a2acfb-3149-4067-9e78-04a153dabad0",
      "contentName": "Epistemology of appearance",
      "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
      "parentId": "173ad8a6-566f-4f95-a797-63c5cc25c135",
      "content": "All of the post-Parmenidean philosophers, like Parmenides himself, presupposed that the real world is different from the one that human beings perceive. Thus arose the problems of epistemology, or theory of knowledge. According to Anaxagoras, everything is contained in everything. But this is not what peopleperceive. He solved this problem bypostulatingthat, if there is a much greater amount of one kind of particle in a thing than of all other kinds, the latter are not perceived at all. The observation was then made that sometimes different persons or kinds of animals have different perceptions of the same things. He explained thisphenomenonby assuming that like is perceived by like. If, therefore, in the sense organ of one person there is less of one kind of stuff than of another, that person will perceive the former less keenly than the latter. This reasoning was also used to explain why some animals see better at night and others during the day. According to Democritus, atoms have no sensible qualities, such as taste, smell, or colour, at all. Thus, he tried to reduce all of them totactilequalities (explaining a bright white colour, for instance, as sharp atoms hitting the eye like needles), and he made a most elaborate attempt to reconstruct the atomic structure of things on the basis of their apparent sensible qualities.\nAlso of very great importance in the history of epistemology wasZeno of Elea(c. 495–c. 430bce), a younger friend of Parmenides. Parmenides had, of course, been severely criticized because of the strange consequences of his doctrine: that in reality there is no motion and no plurality because there is just one solid being. To support him, however, Zeno tried to show that the assumption that there is motion and plurality leads to consequences that are no less strange. This he did by means of his famousparadoxes, saying that the flying arrow rests since it can neither move in the place in which it is nor in a place in which it is not, and thatAchillescannot outrun a turtle because, when he has reached its starting point, the turtle will have moved to a further point, and so on ad infinitum—that, in fact, he cannot even start running, for, beforetraversingthe stretch to the starting point of the turtle, he will have totraversehalf of it, and again half of that, and so on ad infinitum. All of theseparadoxesare derived from the problem of thecontinuum. Although they have often been dismissed as logical nonsense, many attempts have also been made to dispose of them by means of mathematical theorems, such as the theory of convergent series or the theory of sets. In the end, however, the logical difficulties raised in Zeno’s arguments have always come back with avengeance, for the human mind is so constructed that it can look at acontinuumin two ways that are not quite reconcilable.",
      "imagesId": [],
      "createdAt": "2025-04-26T21:51:06.738Z",
      "updatedAt": "2025-04-26T21:51:06.738Z",
      "images": []
    }
  ],
  "eventArticle": {
    "articleId": "9d40214a-6961-45be-93da-d8264549c0a0",
    "periodId": "d4077f3b-d0f3-4182-99e7-b53b060dc69e",
    "topicId": "7a88139f-b851-451e-a7c3-480bbb45c0a7",
    "createdAt": "2025-04-26T21:52:15.545Z",
    "updatedAt": "2025-04-26T21:52:15.545Z",
    "period": {
      "periodId": "d4077f3b-d0f3-4182-99e7-b53b060dc69e",
      "periodName": "First Industrial Revolution",
      "periodImage": "",
      "startYear": 1760,
      "endYear": 1840,
      "createdAt": "2025-04-26T15:44:32.890Z",
      "updatedAt": "2025-04-26T15:44:32.890Z"
    },
    "topic": {
      "topicId": "7a88139f-b851-451e-a7c3-480bbb45c0a7",
      "topicName": "Philosophy and Thought",
      "topicImage": "",
      "createdAt": "2025-04-26T15:44:32.890Z",
      "updatedAt": "2025-04-26T15:44:32.890Z"
    }
  }
}